{"idx": 1, "truncated_input": "\"Whoever gets him, they'll be getting a good one,\" David Montgomery said.\nINDIANAPOLIS — Hakeem Butler has been surrounded by some of the best wide receivers on the planet this week at the NFL Scouting Combine.\nIt’s an experience that might humble some. But for Butler, it has only enhanced his confidence.\nAs it stands, 22-year-old Butler is not regarded as the best wide receiver in this year’s NFL Draft. He’s projected by some experts to go as late as the third round. But when wide receivers were measured Thursday, Butler gained some attention: He led all receivers in height (6-foot-5 3/8), arm length (35 1/4 inches) and wingspan (83 7/8 inches).\nOn Thursday, running back David Montgomery, who played with Butler at Iowa State, captured the general vibe surrounding Butler here.\nButler says he’s met with", "baseline_completion": " every NFL team on an informal basis. He had “nine or 10” formal meetings set up for Friday night, but didn’t divulge which teams he’d be sitting down with.\nThere is clear interest in Butler, who declared for the draft after his junior season in which he had 60 receptions for 1,318 yards and nine touchdowns.\nBut in his mind, the hype machine hasn’t been turned up high enough — yet.\nButler, of course, is talking about Saturday’s wide receiver workouts. If he crushes the drills, he could vault up the draft board — perhaps into the first round. And he feels well-prepared because he’s spent the past few months working out with some legendary NFL receivers in Calvin Johnson and Anquan Boldin.\nButler met Boldin at the South Florida gym where he trains. He was connected to Johnson through his agent.\nJohnson and Boldin are known for being precise, tactical receivers. But Butler says the most valuable lesson of working with them has been learning about how they think.\nButler admitted the first time he worked with Johnson, who went to six Pro Bowls with the Detroit Lions from 2010-15, that he was a little starstruck.\nButler is hoping that one day he can leave a legacy like Boldin or Johnson. But for now, his goal is to prove what he already believes is true: that he is the top receiver in this draft.", "orig_sample_length": 509, "prompt_length": 201, "real_completion_length": 308, "no_bl_gen_time": 11.379986763000488, "w_bl_gen_time": 12.588146686553955, "no_bl_output": " respectability to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "w_bl_output": " a few days of a few days of a few days of a few days of a few days later in a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.05718586313065572, "no_bl_tok_per_sec": 17.486839321026675, "w_bl_sec_per_tok": 0.06325701852539677, "w_bl_tok_per_sec": 15.808522489856438, "baseline_loss": 5.610692024230957, "baseline_ppl": 273.33331298828125, "no_bl_loss": 1.8127566576004028, "no_bl_ppl": 6.127315044403076, "w_bl_loss": 1.5773241519927979, "w_bl_ppl": 4.841981887817383}
{"idx": 2, "truncated_input": "8i announced today it has launched a web player, the 8i Portal, for its volumetric 3D video of people in virtual reality.\nUsing 8i’s technology and VR goggles, you’ll be able to walk around a person inside a virtual environment to see their entire being. The Wellington, New Zealand-based startup said its VR platform will allow you to view fully volumetric 3D video.\nPreviously, VR cameras could record a partial torso of a person, but the 8i Portal goes beyond that. It enables “complete freedom of movement,” and it gives you a sense of “presence,” or the feeling that you are there in the virtual space with the person. It creates a more “emotional connection with the person you are watching,” the company said in the video below.\n8i’s platform will let you create, experience, and share immersive 3D video of real people", "baseline_completion": " — for virtual reality, augmented reality, and the web. I’m not sure how it can be used for games, but you can see how it could give you a unique perspective at a music concert or theatrical performance.\nLinc Gasking, who previously ran countingdown.com (which DreamWorks acquired), and Eugene d’Eon, formerly of Weta Digital and Nvidia, founded the startup in 2014.\nTo date, 8i has raised $14.8 million in funding from investors including RRE Ventures, Founders Fund Science, Horizons Ventures, Samsung Ventures, Dolby Family Ventures, Signia Venture Partners, Bertelsmann Digital Media Investments, Sound Ventures, Inevitable Ventures, Freelands, and Advancit Capital.\nThe new 8i Portal is a volumetric VR player for Oculus Rift and the HTC Vive VR platforms. If you use the Oculus Rift or Vive headsets, you can view cool VR videos of people who look real, not computer-generated, and move around them, make eye contact, and feel “true presence,” the company said.", "orig_sample_length": 427, "prompt_length": 201, "real_completion_length": 226, "no_bl_gen_time": 10.307883739471436, "w_bl_gen_time": 12.58577013015747, "no_bl_output": " to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "w_bl_output": " can be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.051798410751112745, "no_bl_tok_per_sec": 19.305611610458875, "w_bl_sec_per_tok": 0.06324507603094207, "w_bl_tok_per_sec": 15.811507594848322, "baseline_loss": 6.480501174926758, "baseline_ppl": 652.2977905273438, "no_bl_loss": 1.70682954788208, "no_bl_ppl": 5.511459827423096, "w_bl_loss": 1.739356279373169, "w_bl_ppl": 5.693676948547363}
{"idx": 3, "truncated_input": "The Arlington County Board plans to vote Saturday afternoon on giving Amazon $23 million and other incentives to build a headquarters campus in Crystal City, but only after hearing scores of northern Virginia residents and advocates testify for or against the project.\nThe five-member board is expected to support the plan, which was announced amid much hoopla on Nov. 13. The proposed county incentives are part of an agreement in which Amazon would occupy significant office space and bring at least 25,000 high-paying jobs to Arlington in coming years.\nOpponents hope to postpone the vote until after additional public hearings, where they want representatives of the online retail giant to answer questions directly from anyone in the community.\nThe Saturday hearing was scheduled to begin no earlier than 1 p.m. and last several hours before the vote. Ninety-one people signed up in advance to speak on the topic.\nIn the four months since Arlington won a much-publicized, nationwide contest to attract the facility known as HQ2", "baseline_completion": ", Arlington residents have been asking questions about its impact on their community.\nPeople have looked at the county’s five online Q&A sessions 14,000 times, and about 400 attended community events to discuss the provisions in the Amazon agreement. Board members and county staff also met with scores of civic organizations, served on multiple panels and appeared on television, online and in news articles to discuss the deal.\nMost Arlingtonians, northern Virginians and residents of the Washington region support Amazon’s arrival, several surveys have found. Business organizations, universities and nonprofit groups came out strongly for the deal.\nBut a small, vocal group of activists has sought to block the project, saying that the county and commonwealth should not give any incentives to one of the world’s most valuable companies. They also have demanded housing and job protections for existing residents.\nThese opponents — including left-wing organizations and immigrants groups — felt empowered after Amazon canceled plans last month to build a headquarters facility in New York City, also with 25,000 jobs. The company withdrew after criticism of the plan from some elected leaders, unions and community activists.\nIn Virginia, however, such opposition did not appear to catch fire among the broader public.\nOfficials estimate that the Amazon project’s net fiscal impact on Arlington could be worth additional revenue of $162 million over 12 years and $392.5 million over 16 years.\nThe incentives agreement promises the world’s largest online retailer cash grants estimated at about $23 million if it occupies 6.05 million square feet of office space in Crystal City and Pentagon City through 2035.\nThe money would come from an expected increase in the hotel, motel and lodging tax paid by visitors; Amazon would get up to 15 percent of that increase, pegged to how much floor space is in active use by the company each year from 2020 to 2035.\nAmazon’s offices will be located within an already-established special tax district where a portion of the property tax revenue goes toward infrastructure improvements such as parks and wider sidewalks.\nThe incentive agreement says that half of any new revenue from that district starting in 2021 will go specifically toward improvements around the Amazon buildings for the following 10 years. That grant is worth an estimated $28 million but the county says it’s not a grant just for Amazon, because the improvements will benefit other companies in the immediate area. Amazon will have a chance to express its opinion on how the county uses the money, although the board will make the decision.\nThe county also offered Amazon the possibility of using its fast, fiber-optic network connection, which would be the subject of a separate agreement if the company chooses to use it.\nIt’s not yet clear whether Amazon will pay the local business license tax because that tax is levied only on certain types of business, and Amazon has not yet announced which of its business units will be based in Arlington. If the company does pay the license tax, then some of its operations could be eligible for a discount of up to 72 percent under an existing program designed to attract technology companies.\nWhile Arlington pored over the details, the Virginia General Assembly passed, and Democratic Gov. Ralph Northam signed, an incentives package worth up to $750 million for Amazon.", "orig_sample_length": 866, "prompt_length": 201, "real_completion_length": 665, "no_bl_gen_time": 10.336713075637817, "w_bl_gen_time": 12.549938201904297, "no_bl_output": " to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "w_bl_output": ", as well known as well as well as well as well as well as well as well as well as well as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.051943281787124713, "no_bl_tok_per_sec": 19.25176780508836, "w_bl_sec_per_tok": 0.06306501608997134, "w_bl_tok_per_sec": 15.856651785727855, "baseline_loss": 5.938148498535156, "baseline_ppl": 379.23211669921875, "no_bl_loss": 1.7639822959899902, "no_bl_ppl": 5.835630416870117, "w_bl_loss": 1.9631239175796509, "w_bl_ppl": 7.12153959274292}
{"idx": 5, "truncated_input": "The Hawaii man who was fired after issuing the false ballistic missile alert in mid-January told reporters Friday that he was very upset over the incident but remained adamant that it appeared, at the time, to be a real-life attack.\nThe former state employee – a man in his 50s who asked to remain anonymous for his safety – said that he was “100 percent sure” that the drill on Jan. 13 was real, even though several other employees heard the word “exercise” repeated throughout the message, according to officials.\nOnce the man realized what had happened, he said he felt like he’d sustained a “body blow.” Since then, he’s reportedly been distressed to the point that he has had trouble eating and sleeping.\nDuring a news conference on Tuesday, investigating officer Brig. Gen. Bruce Oliveira shared details of the state’s probe and said when the mistake was realized, the employee “f", "baseline_completion": "roze” and “seemed confused.” Another employee had to resume his duties and send a correction message, Oliveira said.\nThe employee also reportedly had at least two previous incidents in which he mistook drills for real-world events, including for tsunami and fire warnings. But Oliveira said the employee was previously counseled and allowed to resume his duties.\nFollowing the event, the employee was fired and Vern Miyagi, who oversaw the Hawaii Emergency Management Agency, took responsibility and resigned.\nToby Clairmont, the agency’s executive officer, also resigned before disciplinary action could be taken, and authorities are in the process of suspending another worker without pay.\nBy 8:20 a.m., Hawaii EMA tweeted there was “NO missile threat” to the state, but failed to send a phone alert for another 38 minutes, causing mass panic among people who weren’t able to check social media.\nFox News’ Katherine Lam and The Associated Press contributed to this report.", "orig_sample_length": 411, "prompt_length": 201, "real_completion_length": 210, "no_bl_gen_time": 10.335702419281006, "w_bl_gen_time": 12.611562728881836, "no_bl_output": "aulted.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "w_bl_output": ".\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "no_bl_num_tokens_generated": 24, "w_bl_num_tokens_generated": 21, "no_bl_sec_per_tok": 0.43065426747004193, "no_bl_tok_per_sec": 2.32204827755379, "w_bl_sec_per_tok": 0.6005506061372303, "w_bl_tok_per_sec": 1.6651386074390084, "baseline_loss": 5.942682266235352, "baseline_ppl": 380.95538330078125, "no_bl_loss": 8.499957084655762, "no_bl_ppl": 4914.55810546875, "w_bl_loss": 9.502375602722168, "w_bl_ppl": 13391.501953125}
{"idx": 10, "truncated_input": "This month some important Walmart news did not get the attention it deserved. The news wasn't some flashy announcement about virtual reality or about some new service for busy Manhattanites. It was something much more subtle and much more substantive.\nIt was the hire of Valerie Casey. Google \"Valerie Casey\" even today and only two listings make mention of her newfound connection with Walmart on the first page of the returned search results. This amount of attention is unjustifiably slight. Let this piece then serve as the hire's coming out party.\nShrewdly, Walmart has made Valerie Casey, formerly of Frog, Ideo, and Pentagram, its new head of design. She will be charged with leading Walmart into the future and ensuring that all its products and services, from websites to employee and consumer apps, will work in cohesion and from a singular experience design point of view.\n\"What's the big whup?\" you might ask.\nThe big whup is that this announcement clearly", "baseline_completion": " shows that Walmart has jumped feet first into the waters of next generation retailing. Under Doug McMillon's bold leadership, Walmart here again is taking one of the most essential steps to long-term success for any legacy bricks-and-mortar retailer—specifically, redefining how it thinks of the word \"product.\"\nInstead of doing what many retailers do, like staffing de facto \"product\" heads within owned brand development, store operations, e-commerce, etc. and then leaving them to collaborate inside complex organizations with competing priorities, Walmart rightly understands that retailing has become so complex that all these aforementioned roles now need their own steward to ensure alignment.\nWalmart having a mission to help its customers save money and live better is one thing, but putting that promise into coherent action is another thing entirely. Many retailers take such coordinated action for granted, which is why so many legacy retail experiences feel disjointed across the digital and physical divide. Success rarely is found in the compromise and turf wars of internal politics. The buck needs to stop somewhere.\nPrior to e-commerce, before customers had the myriad of options they have today to consume products (via web portals, apps, social media, etc.), retailers were able to differentiate themselves by the products inside their four walls. The strategic practice of product differentiation became so prevalent and such a point of emphasis that it even gave way to the commonly heard parlance of retail being a \"merchant-led business.\"\nThe growth of e-commerce in the 1990s and 2000s rewrote the playbook though. During this period, Jeff Bezos built Amazon into the \"Everything Store.\" His idea was that as long as he could offer a great selection, convenience and great prices, consumers would gravitate towards Amazon over time. Boy, was he right, and, boy, did they ever gravitate towards Amazon.\nWhether customers try to order direct from Amazon or from one of Amazon's many third-party suppliers on its marketplace, it is becoming more and more difficult for a consumer not to find what he or she desires on Amazon. At this point, nearly 50% of all first product searches start on Amazon, indicating that Amazon is settling into the digital and product acquisition-equivalent of the 1980s shopping mall. The products inside a retailers four walls or within a retailers assortment are now, in a way, almost non-differentiating.\nBezos saw that the opportunity in retail was to put the customer first and to think not about the product he or she buys but about the Product he or she really buys—for him, the Product (big \"P) of the Amazon brand. The white space in retail was no longer leading with product (small \"p\"), but leading with the discipline of Product Management, where his Product, or in this case, the Amazon brand, was the magic created at the intersection of great experience design, technology and business. Product was not a pair of khaki pants, a new set of bed sheets or a bar of soap. It was the culmination of a friction-free user experience that delivered on the universal truths of selection, convenience, and low prices and that exceeded consumers' expectations consistently, again and again.\nSadly, many retailers have not grasped this \"Product Problem.\" The greatest Product Manager in history, Jeff Bezos, saw the problem early on, while many merchant princes missed the signals and have even now admitted that they underestimated the impact technology would have on retail. Fortunately, Walmart's recent hire of Casey indicates that there could be light at the end of what has, until now, been a dark tunnel.\nWalmart is big. The acquisitions of Jet.com, Bonobos, ModCloth, etc. have only made it bigger and more complex, saying nothing too of the ever-changing demands of consumers and Walmart's ever-expanding interests abroad (see Flipkart). Therefore, it is only right that someone, like Casey, take up the mantle to oversee and to fight for the consumer and to ensure that all Walmart's activities look, feel, and convey the Walmart brand in the simplest, most straightforward way as possible.\nThe products inside Walmart's stores are immaterial to its future success. What matters is the Product of its brand—its website, its store, its app-based services, etc. Those are the Products that matter. In a future world where the only thing that differentiates a physical from a digital experience is the memory and delight of being somewhere, a Walmart store is the Product or collective set of experiences that will get someone off his or her couch.\nA tube of toothpaste just won't cut it anymore.\nWhile the products within Walmart's store or on its website will come and go and ebb and flow, the shroud of the Walmart brand will be what matters. Walmart's store and its digital properties will be the envelopes that carry its brand promise.\nThe experiment that bears this out has already been run. We need look no further than the history of Amazon and also to the young upstart CEOs like Emily Weiss, Katrina Lake and Adam Goldenberg who are already thriving in this new world. Their collective early success indicates that they get the punchline to the joke of 21st century retail—that the retail of the future won't be merchant led, it will be Product led.\nBest of luck, Valerie Casey. A bricks-and-mortar nation turns its lonely eyes to you.", "orig_sample_length": 1304, "prompt_length": 201, "real_completion_length": 1103, "no_bl_gen_time": 10.318714618682861, "w_bl_gen_time": 12.596710205078125, "no_bl_output": " defined as well known as well known as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as you can be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "w_bl_output": " not only one of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.05185283727981337, "no_bl_tok_per_sec": 19.285347773810365, "w_bl_sec_per_tok": 0.06330005128179962, "w_bl_tok_per_sec": 15.797775511242365, "baseline_loss": 6.252323150634766, "baseline_ppl": 519.2176513671875, "no_bl_loss": 1.9024525880813599, "no_bl_ppl": 6.702312469482422, "w_bl_loss": 1.642255425453186, "w_bl_ppl": 5.166809558868408}
{"idx": 11, "truncated_input": "University of Utah track and field athlete Lauren McCluskey was found shot dead Monday night in the backseat of a vehicle outside a campus dormitory, according to university police. The suspected shooter was 37-year-old Melvin Rowland, a man McCluskey’s family said she had recently stopped dating. Rowland’s body was found a few hours later at a church; police said he died by suicide.\nAt a press conference, university police chief Dale Brophy said that McCluskey had filed a police report with them “on Oct. 12 and Oct. 13” about threats from Rowland. There was “some follow-up” and it was assigned to a detective who was “working to build a case against our suspect at that time,” Brophy said. The police chief would not go into further details about what happened with that investigation.\nOn Monday night, Brophy said that police got a call from a frantic", "baseline_completion": " mother saying “something happened to her daughter.” In a statement released by the McCluskey family, McCluskey’s mother said that she was on the phone with her daughter that night when she suddenly heard Lauren McCluskey yell “no no no!” Afraid her daughter was in a car accident, she stayed on the line while her husband called 911. A few minutes later, the family statement said, “a young woman picked up the phone and said all of Lauren’s things were on the ground.” It was the last time she spoke with her daughter.\nPolice officers went to the parking lot and found McCluskey’s body, Brophy said. The university issued an alert and an order for students to “secure-in-place.” It was lifted at 11:46 p.m., according to the university’s website, after police determined that Rowland was no longer on campus. Brophy said that Rowland was picked up by a vehicle and, about 1:15 a.m. he was spotted by Salt Lake City police who ran after him. Rowland got inside the Trinity AME Church, where he killed himself. A retired pastor told the Salt Lake Tribune that, to the best of his knowledge, Rowland didn’t attend the church and he had no idea why he chose that building.\nThe family of McCluskey, 21, said that their daughter had dated Rowland for about a month. She ended the relationship after she learned about his criminal history.\nLauren was a senior student athlete on the University of Utah track team. She was an outstanding student with a 3.75 GPA majoring in Communication and was excited to graduate in May 2019. She was a 2015 honors graduate of Pullman High School where she was Washington state champion in the high jump and the school record holder in the 100 meter hurdles. She attended Capital Church in Salt Lake City. She loved to sing and had strength and determination. She was dearly loved and will be greatly missed.\nPolice said the two had been in a “prior relationship,” but wouldn’t comment further. According to Utah Department of Corrections, Rowland was convicted in 2004 of enticing a minor, a second-degree felony, and attempted forcible sexual abuse, a third-degree felony. His last known home, Brophy said, was a halfway house.", "orig_sample_length": 701, "prompt_length": 201, "real_completion_length": 500, "no_bl_gen_time": 10.295292854309082, "w_bl_gen_time": 12.574984788894653, "no_bl_output": " to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "w_bl_output": " state of a few days ago, which is a few days ago, which is a few days ago, a few days ago, which is a few days ago, which is a few days ago, a few days ago, which is a few days ago, a few days ago, a few days ago, a few days ago, a few days ago, a few days ago, a few days ago, a few days ago, a few days ago, a few days ago, a few days ago, a few days ago, a few days ago, a few days ago, a few days ago, a few days ago, a few days ago, a few days ago, a few days ago, a few days ago, a few days ago, a few days ago, a few days ago, a few days ago, a few days ago, a few days ago, a few days ago, a few days ago, a few days ago, a few days ago,", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 197, "no_bl_sec_per_tok": 0.05173513997140242, "no_bl_tok_per_sec": 19.32922188966279, "w_bl_sec_per_tok": 0.06383241009591195, "w_bl_tok_per_sec": 15.66602292624454, "baseline_loss": 5.622657775878906, "baseline_ppl": 276.62359619140625, "no_bl_loss": 1.7369716167449951, "no_bl_ppl": 5.680115699768066, "w_bl_loss": 1.3959825038909912, "w_bl_ppl": 4.038940906524658}
{"idx": 12, "truncated_input": "The Linux kernel now includes everything that is needed to use 3D acceleration with all GeForce graphics chips. Drivers have also been added for a Wireless Gigabit chip and a PCIe WLAN chip from Realtek.\nIn his email announcing the release of Linux 3.8-rc6, Linus Torvalds emphasised that he wanted the seventh release candidate to be the last one. When he released RC7 on Friday, however, he made no mention of whether there would be an eighth RC before the final version of Linux 3.8.\nAs long as no more major problems arise, though, the Linux kernel 3.8 should still be released this month. This article on driver updates will therefore bring the \"Coming in 3.8\" Kernel Log mini-series to a close. The first two parts of the series focused on the changes that kernel developers made to filesystems and storage and the platform and infrastructure code for Linux 3.8.\nIn Linux 3.8, the", "baseline_completion": " Nouveau kernel driver will include everything that the OpenGL driver â\u0080\u0093 which is part of current versions of Mesa 3D and is also called Nouveau â\u0080\u0093 needs to use the 3D acceleration of all GeForce graphics chips available so far without further configuration. This is the first time that the Nouveau developers, who use reverse engineering to get the information they need to program their drivers, have managed this feat; before this, they were still lacking standard 3D support for some newer Fermi GPUs and the Kepler graphics chips, which have been on the market since March 2012 (1, 2, 3). For many computers, however, NVIDIA's proprietary graphics driver will still be a better choice, since Nouveau can't activate the faster operation modes for many of the newer GeForce chips, resulting in 3D performance that leaves something to be desired. There are also other issues, particularly when it comes to video acceleration and fan management support.\nVersion 3.8 of Linux is the first to include a simple kernel graphics driver for the graphics cores in NVIDIA's TegraÂ 2 and 3 SoCs (system on a chip) (1, 2, 3 and others). The driver is not from NVIDIA; it was developed mostly by a developer from the German company Avionic Design. The company works on embedded solutions in close cooperation with NVIDIA and programmed the driver independently, but with input from NVIDIA. Surprisingly, NVIDIA jumped into the development process, publishing extensions a few weeks ago that let the driver make the graphics cores' acceleration features available, but these improvements did not make it into 3.8. Userland drivers are still needed to use the acceleration functions, and NVIDIA has yet to give any indication that it is interested in releasing those drivers under an open source licence. Nouveau developer Lucas Stach shared background information on the Linux drivers for NVIDIA's Tegra in a presentation at FOSDEM 2013, a recording of which is available on YouTube.\nThe Radeon driver now allows more of the graphics cores' DMA engines, which have previously been largely ignored, to be used from userspace (1, 2, 3, 4, 5). The i915 graphics driver now supports by default the graphics cores of the Haswell processors that Intel will introduce under the name Core i4000 in a few months. The developers have also included a workaround for a bug in the Intel 830 and 845 chipsets so the graphics drivers are supposed to be stable on these chipsets.\nThe virtio_net network driver, which uses paravirtualisation and is especially used with KVM and Xen, should provide better performance now that it can use multiple queues for each network device. The same goes for the Tun/Tap driver, which is also used for system virtualisation as well as other purposes like emulating network hardware.\nThe batman-adv (Better Approach To Mobile Ad-Hoc Networking Advanced) mesh implementation developed as part of open-mesh.org to spontaneously create WLAN networks can now build a distributed ARP table, which allows non-mesh clients on a network to receive quick, reliable answers to their ARP queries.\nThe rtl8723ae driver for the Realtek RTL8723AE PCIe WLAN chip is new (1, 2 and others), as is the wil6210 driver for a Wilocity WLAN chip that operates at 60GHz and uses the IEEE 802.11ad standard promoted by the Wireless Gigabit Alliance (WiGig).\nAnother addition to the kernel is the ar5523 driver, which was started over five years ago for the Atheros USB chipset of the same name. Extensions for supporting more chips and WLAN adapters were added to a number of other drivers; the brcmsmac WLAN driver, for example, now supports the BCM43224 Broadcom chip, while the rt2800usb RaLink driver supports the Sweex LW323 USB WLAN adapter.\nThe cdc-mbim driver, which supports broadband modems that implement Mobile Broadband Interface Model (MBIM ) 1.0, specified by the USB Implementers Forum, is also new (1, 2). MBIM is a USB protocol for connecting modems for laptops, tablets and desktop computers that provide an internet connection using GSM and CDMA-based 3G and 4G (including LTE). Aleksander Morgado provides more details on the protocol and its advantages compared to other technologies in a blog post.\nThe kernel's audio drivers now support the Philips PSC724 Ultimate Edge sound card. The kernel can also handle VIA's VT1705CF HD audio codec now. The merge listing the most important changes to Linux 3.8's sound subsystem includes some other changes to audio drivers.\nThe kernel now includes a driver for human interface devices (HIDs) that use I2C (1, 2 and others), using the \"HID over I2C\" protocol designed by Microsoft and implemented in WindowsÂ 8. Extensions were added to the HID multitouch driver to support some of the features for better finger and movement recognition found in WindowsÂ 8.\nThe drivers for Video4LinuxÂ 2 (V4L2) located in the media subsystem can now use the \"DMA Buffer Sharing Mechanism\" (dma_buf) integrated in Linux 3.3 to share buffer space with graphics cards, which makes it possible that data from video hardware will no longer need to be duplicated in the buffer in order for a graphics chip to display it.\nThe kernel developers have marked the uas driver, which handles the USB Attached SCSI protocol, as broken because it causes problems and is not yet ready for the major distributions.\nAlan Cox has given up kernel development for family reasons, leaving his position as maintainer of the serial driver subsystem. Cox is a Linux veteran who maintained the Linux kernel 2.2, during which time he was considered the second most important kernel developer after Linus Torvalds. Although he hasn't been that far up in the ranks these last few months, Cox has still contributed quite a lot to the development of Linux.", "orig_sample_length": 1459, "prompt_length": 201, "real_completion_length": 1258, "no_bl_gen_time": 10.313055038452148, "w_bl_gen_time": 12.565985202789307, "no_bl_output": " same as well known as well as well as well as well as well as well as well as well as well as you can be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "w_bl_output": " same as well known as well as well as well as well as well as well as well as possible. so far as well as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible.", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 198, "no_bl_sec_per_tok": 0.0518243971781515, "no_bl_tok_per_sec": 19.295931153089942, "w_bl_sec_per_tok": 0.06346457173125912, "w_bl_tok_per_sec": 15.7568226290804, "baseline_loss": 6.514802932739258, "baseline_ppl": 675.0609130859375, "no_bl_loss": 1.9121679067611694, "no_bl_ppl": 6.767744541168213, "w_bl_loss": 1.8514553308486938, "w_bl_ppl": 6.369081974029541}
{"idx": 13, "truncated_input": "The location of the July 15, 2002 flare is shown at left. The other panels compare the scale of Earth to the eruptions. Red shows superheated gas held together by magnetic fields. The time sequence lasts only 80 seconds and yet reveals tremendous amounts of gas leaving the Sun.\nA detailed study of a huge solar eruption reveals that a series of smaller explosions combined in a domino effect to fuel the blast.\nThe findings improve understanding of the Sun's most powerful events and could lead to better forecasting of the tempests, researchers said.\nScientists studied data collected from a radiation flare on the Sun on July 15, 2002. The eruption, ranked as an X-7, was one of the most powerful in recent times. The flare was accompanied by a coronal mass ejection, which is a colossal discharge of electrified gas called plasma. The event was 5,000 million times more powerful than an atomic bomb.\nScientists don't know exactly what triggers such eruptions. They", "baseline_completion": " are associated with strong magnetic fields, however, and emanate from sunspots, which are cooler regions of the Sun that correspond to bottled-up magnetic energy.\n\"Sunspots are at the surface of the Sun, and are essentially the footprints of the magnetic field,\" explained Louise Harra of the Mullard Space Science Laboratory at University College London. \"The magnetic field reaches into the outer atmosphere in the same way as for example a bar magnet has a magnetic field around it.\"\nResearchers had thought the big eruptions are created when magnetic field lines from the core of a sunspot become tangled and reconnect high in solar atmosphere, or corona. The new study contradicts that assumption.\nX-7 flare started when plasma from below the Sun's surface broke suddenly through.\n\"Below the surface of the Sun a dynamo process is working creating magnetic field,\" Harra explained in an email interview. \"When this becomes buoyant it can rise to the surface of the Sun, and into the atmosphere.\"\nThe plasma collided with a strong magnetic field at the surface, and the interaction triggered release of \"phenomenal amounts of energy,\" the researchers concluded. There were three eruptions, each triggering the next.\nThe gas was heated to 36 million degrees Fahrenheit (20 million Celsius) before being flung up into the solar atmosphere at 90,000 mph (40 kilometers per second).\n\"We have observed the flows of hot gas for the first time, enabling us to see that several small flares combine to create a major explosion,\" Harra said. \"This may eventually enable us to predict large flares before they erupt.\"\nNot all solar flares are accompanied by coronal mass ejections, and nobody knows for sure why.\n\"It must be a combination of the magnetic field strength and the magnetic configuration that will allow field lines to be opened and hence the release of gas,\" Harra said.\nThe observations were made with SOHO spacecraft, a joint project of NASA and the European Space Agency. The results were presented last week at a meeting of the Royal Astronomical Society.", "orig_sample_length": 623, "prompt_length": 201, "real_completion_length": 422, "no_bl_gen_time": 10.303661108016968, "w_bl_gen_time": 12.54492473602295, "no_bl_output": "’s of the same as well known as well known as well as well as well as well as well as well as well as well as well as you can be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be", "w_bl_output": " did not only one of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.051777191497572705, "no_bl_tok_per_sec": 19.31352340821498, "w_bl_sec_per_tok": 0.06303982279408517, "w_bl_tok_per_sec": 15.862988753417417, "baseline_loss": 5.906520843505859, "baseline_ppl": 367.42559814453125, "no_bl_loss": 1.9707472324371338, "no_bl_ppl": 7.176036834716797, "w_bl_loss": 1.5976167917251587, "w_bl_ppl": 4.941242218017578}
{"idx": 14, "truncated_input": "Last summer I took a cross-country road trip with a group of people driving different types of electric vehicles.\nIt was an amazing experience, and our trip, our adventures, and our misadventures were portrayed in the documentary Kick Gas.\nThat experience gave me the idea to take my own road trip to experience the freedom of traveling alone on an electric motorcycle.\nMy goals were simple: ride the great motorcycle roads of America, meet other electric motorcycle riders, and visit friends.\nThe cross-country trip last summer taught me that charging stations are plentiful near cities, but sparse near the good roads. By \"good roads\" I mean the mountainous, twisty, curvy, windy, fun roads you dream about when buying a motorcycle!\nTo take road trips in an electric vehicle as easily as in a gas-powered vehicle, two things are necessary: a car with a highway range of 150-plus miles, plus DC fast charging available every 50 miles. That would be", "baseline_completion": " a good beginning as we await an affordable 1,000-mile battery.\nCurrently drivers must rely on the availability of public and private charging stations to venture further than half the range of their electric vehicle. This creates a bit of an adventure if you want to take a journey of, say, 4,000 miles.\nPublic charging stations are easiest to access. On the East Coast, you can show up at a charging station and pretty much expect that nobody else will be plugged in.\nThat's not the case in California, which has a much higher density of electric vehicles--at least some of them already using the charging station you've just arrived at.\nMy favorite public charging stations are at restaurants, so I have a place to eat and relax while my vehicle is charging. On this trip, I stopped at several Cracker Barrel restaurants in Tennessee and a Makuto's Japanese restaurant in Boone, North Carolina.\nCar dealerships will let motorcycles charge, although not always electric cars of another make. Nissan in particular has outfitted their dealerships with 240-Volt Lvel 2 chargers, and more recently, some of them now have high-powered CHAdeMO DC fast chargers.\nEven dealerships that normally only allow charging by cars sold by that dealer will allow me to plug in my electric motorcycle, since it's unique. Some dealers happily let me charge, others let me charge after a little conversation.\nStill, recharging my electric bike at a car dealer proved less than ideal, since they're often far from food or anywhere interesting to hang out.\nPersonal homes are fun if you plan ahead. I've met some interesting folks who make their home Level 2 charging stations available to travelers by listing them on the PlugShare app. They are lovely people, and meeting them is a fun part of being an early adopter.\nClearly, though, using someone's home charging station is not a sustainable way to propel electric vehicles forward.\nThe fun riding part of my journey began in Front Royal, Virginia, on Skyline Drive going through the Shenandoah Mountains. The road winds its way around the mountaintops and was designed as a sightseeing project by the Civilian Conservation Corps during the Great Depression of the 1930s.\nAfter a great day on Skyline Drive, I got to ride through the back woods around Blacksburg, Virginia, until I reached the glorious Blue Ridge Parkway. The road is absolutely incredible, flowing through farmland and mountains on either side for miles and miles.\nI made a brief stop in Asheville to swing -dance to bluegrass music with friends from Italy; I rode to the top of Mt. Mitchell, and then I headed to the best motorcycle road in America, known as the Dragon.\nAfter riding the Dragon, I headed to Nashville to visit some electric-motorcycle friends, and we headed down the famous Natchez Trace Parkway. This is another phenomenally beautiful road with scenic stops and meandering curves that caress the local terrain.\nThe first half of my journey ended in St. Louis, where I attended my cousin's wedding and visited the Country Music Hall of Fame. My trip was broken up because I had to fly back to New York City for a week, but I'll resume today--traveling to Chicago, Cleveland, and Rochester, New York, on my way to ride up New Hampshire's Mount Washington.\n1) It's still an adventure to take an electric-vehicle road trip (unless you're driving a Tesla using the company's Supercharger network).\n2) While it's easy to find charging stations, they're not always guaranteed to be available. They could be in use already, not working at all, or--worst of all--they might be \"ICEd,\" or blocked by a thoughtless driver of an internal-combustion engine (ICE) car.\n3) Most people at RV campgrounds are super-nice! I've shown up to many campgrounds unannounced, and most were incredibly welcoming and let me recharge my motorcycle for free (even though I always offer to pay the dollar or so for the electricity).\n4) To take a road trip in any electric vehicle, you need to plan ahead. At the start of each day, I decided where my stops for charging would be--including alternate locations if available.\n6) A couple of RV parks have claimed that they needed to replace receptacles to their 50-Amp hookup after a Tesla used it. This should be further investigated, as electric-vehicle owners very much don't want to burn those bridges or create any distrust of our community on the part of park owners.\n7) When I learn a Tesla has stopped at an RV park, the park operators will often ask me for $10 or more to recharge (my bike uses maybe $0.60 of electricity). This highlights the fact that most people have no idea how much electricity costs--and no one understands how much electricity different electric vehicles use. My motorcycle battery holds one-tenth the energy of a Tesla battery, so the cost for electricity is a factor of 10 less--but I often have to explain that slowly and carefully.", "orig_sample_length": 1259, "prompt_length": 201, "real_completion_length": 1058, "no_bl_gen_time": 10.335951566696167, "w_bl_gen_time": 12.575002193450928, "no_bl_output": " able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to end up to end up to be able to end up to be able to end up to be able to be able to end up to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able", "w_bl_output": " able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.051939455109025964, "no_bl_tok_per_sec": 19.253186193442016, "w_bl_sec_per_tok": 0.06319096579623582, "w_bl_tok_per_sec": 15.825046941434282, "baseline_loss": 5.860939025878906, "baseline_ppl": 351.05364990234375, "no_bl_loss": 1.895092248916626, "no_bl_ppl": 6.653162002563477, "w_bl_loss": 1.8901324272155762, "w_bl_ppl": 6.620245456695557}
{"idx": 19, "truncated_input": "NEW YORK (AP) — Could the U.S. lose its top credit rating even if a deal is reached to raise the debt limit?\nMarket analysts and investors increasingly say yes. The outcome won't be quite as scary as a default, but financial markets would still take a blow. Mortgage rates could rise. States and cities, already strapped, could find it more difficult to borrow. Stocks could lose their gains for the year.\n\"At this point, we're more concerned about the risk of a downgrade than a default,\" said Terry Belton, global head of fixed income strategy at JPMorgan Chase. In a conference call with reporters Tuesday, Belton said the loss of the country's AAA rating may rattle markets, but it's \"better than missing an interest payment.\"\nEven with a deadline to raise the U.S. debt limit less than a week away, many investors still believe Washington will pull off a last-minute deal to avoid a catastrophic default. Washington has", "baseline_completion": " until Aug. 2 to raise the country's $14.3 trillion borrowing limit or risk missing a payment on its debt. President Barack Obama and Congressional Republicans have failed to reach an agreement to raise the debt ceiling and pass a larger budget-cutting package. Politicians have tied raising the debt limit and spending cuts together.\nBut at least one credit rating agency has already made it clear that unless that agreement includes at least $4 trillion in budget cuts over the next decade, the country's AAA rating could be lost. Right now, the proposals under discussion cut around $2 trillion or less.\nStandard & Poor's warned earlier this month that there was a 50-50 chance of a downgrade, if Congress and President Obama failed to find a \"credible solution to the rising U.S. government debt burden.\" S&P said it may cut the U.S. rating to AA within 90 days. Passing a $4 trillion agreement could prevent a downgrade, S&P said.\nThe other chief rating agency, Moody's Investors Service, said the U.S. government would likely keep its top rating if it avoids a default.\nSpokesmen from both Moody's and S&P said they wouldn't comment beyond their recent reports.\nJPMorgan's Belton said clients have started asking how markets will respond if the U.S. loses its AAA rating. A drop to AA will mean permanently higher borrowing costs for the U.S. government, he said. And because government lending rates act as a floor for other lending rates, mortgages, student loans, corporate debt and other types of loans will become more expensive.\nBelton estimates that borrowing costs would rise between 0.60 to 0.70 points. That may not sound like much. But mortgage interest rates, which have hovered around 4.5 percent for the last several weeks, could rise by at least that amount, to more than 5.1 percent.\nAnd for the federal government, it eventually means an extra $100 billion in interest payments to Treasury holders like China each year.\n\"That's a huge number,\" Belton said. That $100 billion a year that could be spent elsewhere on everything from education to infrastructure.\nAn increase in interest rates could soon become a drag on other parts of the economy, experts say. State governments and insurance agencies would also be downgraded — and states are already having financial troubles. Business confidence could sink again, leading to prolonged high unemployment.\nBut some investors aren't unhappy about the thought of a U.S. debt downgrade. Don Quigley, manager of the $1.5 billion Artio Total Return Bond fund reasons that such a move could provide a buying opportunity. He believes that a downgrade would immediately send the yield of the 10-year bond up to 3.15 percent from its current level of about 3 percent.\nIf the economy sinks further in part because of higher interest rates, investors would very likely return to buying bonds, Quigley said. That's what they've done during the last several years both during the financial crisis and recession, and again the last several months as the economic recovery has slowed.\nTreasurys would keep their allure, in part, because there are few alternatives for large foreign buyers looking for a market big enough to handle massive investments.\n\"The German market is not big enough and Japan has its own problems,\" Quigley said.\nA cut to the U.S. credit rating could hit stocks harder than bonds. A study by Janney Montgomery Scott looked at rating changes to countries over the past decade. After Spain was downgraded in 2009, Spain's stock market fell 8 percent in three months. A cut to Japan's credit rating in 2011 knocked the country's stock market down 3.4 percent in three months. The study, released in April, suggested the S&P 500 would fall 6% after a U.S. downgrade, erasing all its gains for the year.", "orig_sample_length": 1010, "prompt_length": 201, "real_completion_length": 809, "no_bl_gen_time": 10.308940172195435, "w_bl_gen_time": 12.612751007080078, "no_bl_output": " been able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "w_bl_output": " been able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be to be able to be to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.05180371945826852, "no_bl_tok_per_sec": 19.303633222814614, "w_bl_sec_per_tok": 0.06338065832703557, "w_bl_tok_per_sec": 15.777684018997343, "baseline_loss": 5.846273899078369, "baseline_ppl": 345.9429626464844, "no_bl_loss": 1.9167250394821167, "no_bl_ppl": 6.798656463623047, "w_bl_loss": 1.9237347841262817, "w_bl_ppl": 6.846480846405029}
{"idx": 21, "truncated_input": "IHS Markit INFO, -0.02% a world leader in critical information, analytics and solutions, expanded its alternative data offering for asset managers with the launch of new stock selection and strategy signals covering the automotive sector.\nCovering more than 30 auto manufacturers worldwide and providing more than 10 years of historical data, the 32 new factors are designed to assist in the prediction of stock returns using analytics derived from company-specific datapoints on sales, production and market share. They include multiple financial factors for revenue and sales as well as novel factors covering production of electric vehicles and plant utilization.\nAnalysis by the Research Signals service at IHS Markit finds positive alpha in several of the factors, including, at times, a return spread of up to 1.41% for the Monthly Trend in Production Growth factor and up to 2.64% return spread for the Monthly Trend in Sales Growth factor.\nData inputs for the signals are mined from robust statistical automotive datasets from IHS Mark", "baseline_completion": "it that include vehicle sales and production history, aggregated registration information, manufacturing volumes and vehicle pricing insight for multiple geographies.\nAccording to Greenwich Associates, 50 per cent of institutional investors are planning to increase their usage of alternative datasets.\nResearch Signals delivers valuable investment insights through a comprehensive library of more than 600 global stock selection and strategy signals. The service covers more than 30,000 securities across 80 countries. It extracts valuable investment insights from a broad range of raw financial and industry-specific data sources to enable customers to assess intended and unintended exposures across investment themes.\nIHS Markit INFO, -0.02% is a world leader in critical information, analytics and solutions for the major industries and markets that drive economies worldwide. The company delivers next-generation information, analytics and solutions to customers in business, finance and government, improving their operational efficiency and providing deep insights that lead to well-informed, confident decisions. IHS Markit has more than 50,000 business and government customers, including 80 percent of the Fortune Global 500 and the world’s leading financial institutions. Headquartered in London, IHS Markit is committed to sustainable, profitable growth.", "orig_sample_length": 437, "prompt_length": 201, "real_completion_length": 236, "no_bl_gen_time": 10.302650928497314, "w_bl_gen_time": 12.59550166130066, "no_bl_output": "ed by the same as well known as well as well as well as well as well as well as well as well as well as well as well as well as well as well as you can be able to be able to be able to make up to be able to be able to be able to be able to be able to be able to be able to make up to be able to as well known as well as well as well as well as well as well as well as well as well as well as well as well as well as well as possible. as possible. as possible. as possible. as possible. as possible. as possible. as possible. as well as possible. as well as possible. as possible. as possible. as well as possible. as possible. as well as possible. as well as possible. as well as possible. as possible. as well as possible. as well as possible. as possible. as well as possible. as well as possible. as possible", "w_bl_output": " up to be preparedness of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.05177211521857947, "no_bl_tok_per_sec": 19.315417107801107, "w_bl_sec_per_tok": 0.06329397819749075, "w_bl_tok_per_sec": 15.799291314566863, "baseline_loss": 5.951539039611816, "baseline_ppl": 384.3443908691406, "no_bl_loss": 1.5737438201904297, "no_bl_ppl": 4.824676990509033, "w_bl_loss": 1.4713993072509766, "w_bl_ppl": 4.355325222015381}
{"idx": 22, "truncated_input": "MK Moshe Feiglin in a Knesset committee meeting, next to MK Ahmad Tibi, in 2014. It appears Feiglin is on his way back to the Knesset, while Tibi just sank below the threshold minimum vote.\nAn Israel Hayom poll published Friday morning shows former IDF chief of staff with 19 seats, the Likud down from 30 to 28, the Labor Party falling to its lowest point so far –5 seats, Yair Lapid’s Yesh Atid stuck in the mud with 9 seats (down from its current 11, which is down from its previous Knesset list of 19), and, for the first time in this campaign, the Zehut (Identity) party, headed by former Likud MK Moshe Feiglin who is a regular pundit at Jewish Press Online, crossing the electoral threshold with 4 seats.\nThe numerous splits of the past few months, on the left and on the right", "baseline_completion": "—some of which may end up merging by the official deadline set by the Central Elections Committee, have led to many parties that are swinging just above or just below the: Gesher, headed by Orly Levy-Abekasis, receives 4 seats, while Shas, Meretz, Habayit Hayehudi receive only 3.\nHere’s another doozie: Both Avigdor Liberman and his nemesis Ahmad Tibi get only 3 seats and walk into the setting sun, probably not hand in hand.\nAnd like we said, Zehut, headed by Cool Hand Feiglin, which just held the first open primaries in Israel ever on Tuesday, and did it online (you gave them your ID number and cell number, they SMSed you a code, you clicked in and got to spread 6 points among the candidate/s of your choice) is also on the verge of the electoral threshold – but for the first time looking at the abyss from above, with 4 seats.\nParties that are so far from the threshold they’re already in Party Heaven (doesn’t that sound like the place you’d want to go when the time comes) are Tzipi Livni and Eli Yishai, each of whom receives but one mandate.\nThe survey examined a scenario according to which Gantz and Lapid unite and bring in former Chief of Staff Gabi Ashkenazi. The result: they all get 32 ​​mandates, with the Likud pushed to second place with 30, while Labor falls into the 3.25% abyss and goes to pole paradise with a measly 3 seats (down from 24).\nImmediately after Ganz’s speech, the Likud and New Right tried to associate Ganz with the left, while Resilient to Israel, Gantz’s party, what a name) insisted that theirs is a centrist party. Well, the poll showed that 25% of respondents still do not know how to define him.\nAfter the pollsters removed the “I don’t know” results, 52% of the rest located Gantz at the center, 19% see him as a right-winger, and 29% as left-winger.\nFinal surprise: on the issue of who is more suitable to be the next prime minister, Netanyahu leads safely with 38%, while Gantz gets only 22%.", "orig_sample_length": 700, "prompt_length": 201, "real_completion_length": 499, "no_bl_gen_time": 10.327155113220215, "w_bl_gen_time": 12.573324203491211, "no_bl_output": " side of the whole world’s of the whole world’s of the whole world’s of the whole world’s of the world’s of the whole world’s of the world’s of the world’s of the world’s of the world’s of the world’s of the world’s of the world’s of the world’s of the United States of the world’s of the world’s of the world’s of the world’s of the world’s of the United States of the world’s of the world’s of the world’s of the world’s of the United States of the world’s of the world’s of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the", "w_bl_output": "-", "no_bl_num_tokens_generated": 198, "w_bl_num_tokens_generated": 1, "no_bl_sec_per_tok": 0.05215734905666775, "no_bl_tok_per_sec": 19.17275356371205, "w_bl_sec_per_tok": 12.573324203491211, "w_bl_tok_per_sec": 0.07953346178112006, "baseline_loss": 6.423387050628662, "baseline_ppl": 616.0863037109375, "no_bl_loss": 1.6974678039550781, "no_bl_ppl": 5.460103988647461, "w_bl_loss": 1.7337477207183838, "w_bl_ppl": 5.6618332862854}
{"idx": 23, "truncated_input": "SOUND FORGE Audio Cleaning Lab can be used to record any sound you can hear on your computer - from internet radio to LPs and tapes which have been connected to the sound card. When recording older material, particularly when it has been stored on vinyl or cassette, it is likely that the sound quality has deteriorated over time. Using this program you can remove any unwanted extraneous noise such as clicks, pops and hisses and generally improve the overall audio experience working with an easy to use interface.\nOf course, you don't need to record audio either. You can simply import an existing track of segment of music for processing, before exporting the final track.\nAudio Cleaning Lab will remove unwanted sections from a recording, increase the volume of quiet tracks and split longer recording up into multiple sections - in fact, Audio Cleaning Lab can take care of much of this for you automatically. A great level of control is available through the use of a graphic equaliser that can be used to", "baseline_completion": " balance out tone, while additional options are available to improve the quality of video sound, reduce the volume of background music on vocal tracks and much more besides.\nDon't worry, most of the options are presets which you can select to improve or clean your audio. There are options to reduce tape noise from old cassettes, reduce crackling from your LPs, remove wind noise from recorded voice, and even create your own presets to use later. You can increase the loudness of the track, increase the stereo width, add various special effects and much more.\nIf you've been looking for a way to digitise your music collection, Audio Cleaning Labs Deluxe may just be the tool you have been looking for. In a few simple steps you can record music to your computer, enhance its sound and then export the results as high-quality MP3s/OGG/FLAC/AAC and other formats that can be played back on a variety of devices.\nProfessional quality audio clean-up tool which will produce superb results from an instantly accessible program.", "orig_sample_length": 416, "prompt_length": 201, "real_completion_length": 215, "no_bl_gen_time": 10.339324235916138, "w_bl_gen_time": 12.566025018692017, "no_bl_output": " be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "w_bl_output": " be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.051956403195558484, "no_bl_tok_per_sec": 19.24690583826799, "w_bl_sec_per_tok": 0.06314585436528651, "w_bl_tok_per_sec": 15.836352363136843, "baseline_loss": 5.782979488372803, "baseline_ppl": 324.72528076171875, "no_bl_loss": 1.8438832759857178, "no_bl_ppl": 6.3210368156433105, "w_bl_loss": 1.8438832759857178, "w_bl_ppl": 6.3210368156433105}
{"idx": 25, "truncated_input": "President Donald Trump returned to Washington, DC on Monday for a very important event.\nIt was not for a meeting with an international leader.\nAnd it was not for a joint session of Congress.\nNo, on this day, Trump greeted thousands of children. They had come to the White House for the annual Easter Egg Roll.\nThe event has been a U.S. tradition for more than a century. In the late 1800s, local children gathered on the hill beside the president’s house to play a game with their colored eggs following the Easter holiday.\nThe White House Easter Egg Roll was of special interest this year. The Trump administration was very late to organize it. Some people who hoped to attend the event were even worried that it would be canceled.\nPolitical observers said the Easter Egg Roll would show how well Trump’s administration could plan and operate a complex public relations event.\nTalk about the event also brought attention to the first lady, whose office usually", "baseline_completion": " plans the White House Easter Egg Roll. First Lady Melania Trump has not yet moved to Washington, DC. She says she will remain in New York City until her son finishes the school year.\nSo, how did the White House Easter Egg Roll go this year?\nJust fine, early reports say.\nAbout 21,000 children and their families received tickets to this year’s event. They came in small groups to the lawn near the president’s house. They played soccer, tossed bean bags and, of course, pushed hard-boiled eggs down the hill.\nThe event was smaller than in previous years. Last year, for example, about 36,000 people attended.\nThis year’s Easter Egg Roll also did not include performances by top celebrities or professional athletes. Instead, children were invited to draw pictures for U.S. soldiers.\nThe Easter Bunny made an appearance, though, as did both Trump and the first lady. They were there with their 11-year-old son, Barron. The president welcomed his young guests and promised them that the nation was getting stronger, bigger, and better.\nKelly Jean Kelly wrote this story for Learning English. Ashley Thompson was the editor.", "orig_sample_length": 449, "prompt_length": 201, "real_completion_length": 248, "no_bl_gen_time": 10.328963994979858, "w_bl_gen_time": 12.648634910583496, "no_bl_output": " a few months ago. to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "w_bl_output": " a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.05190434168331587, "no_bl_tok_per_sec": 19.266211025299256, "w_bl_sec_per_tok": 0.06356097945016832, "w_bl_tok_per_sec": 15.732923070891284, "baseline_loss": 5.656463146209717, "baseline_ppl": 286.13482666015625, "no_bl_loss": 1.8462544679641724, "no_bl_ppl": 6.336043357849121, "w_bl_loss": 1.6071906089782715, "w_bl_ppl": 4.988776206970215}
{"idx": 26, "truncated_input": "So you might ask yourself, “What is going on?” How can things be so bad that educators feel the need to petition?\nSuperintendent Michael Hanson’s administration issued a mandate to all school principals, vice principals and counselors to lower the number of suspensions and expulsions districtwide using a repackaged, rhetoric-filled behavioral modification program called Restorative Justice.\nThis Restorative Justice concept is not new. These interventions usually fail under the weight of their overexaggerated promises. This leads to an odd belief that if you decrease the number of official suspensions on paper, you can claim success regarding improved behavior.\nFresno Unified board member Christopher De La Cerda, McLane’s representative, highlighted this delusion when he stated, “The data confirms that restorative practices at McLane are working as we intended it to work.” Sort of like bragging that no one drowned in the pool after the water was removed.\nIf the", "baseline_completion": " intention was for more than 80 percent of the teaching staff to be so fed up they needed to file a petition – congratulations! Mission accomplished.\nThe saddest part of this debacle is that it has ironically resulted in increased insecurity and systemic violence for our teachers and students who truly want to be educated.\nBut here is the most disappointing fact: This situation did not need to happen; it was self-inflicted.\nThree years ago, there was a wonderful, accredited, academic program in Fresno Unified that took in up to 1,600 secondary students a year, who either could not – or should not – attend a traditional high school.\nThis program was a last-chance beacon of hope for thousands of students who, by their own fault or the fault of others, would have had no real chance of graduating from high school. It was called the J.E.Young Academic Center (JEY). It provided an educational sanctuary for the very students FUSD is trying to corral with this Restorative Justice debacle.\nEvery student was treated – educationally and emotionally – as a unique individual. JEY accepted the entire spectrum of students; from those whose special needs could not be adequately met, to those whose behaviors could not be adequately accommodated on a traditional high school campus. This program was an oasis for students on the precipice of failure.\nIt was a wonderful independent study program that served the needs of those most in need. Everybody won. But that didn’t matter.\nFor spurious and ego-driven reasons, this program was dismantled and diminished to a mere shell of its former self. It was replaced by a program that failed after two years. Like prisons, it involves removing those in society with unacceptable behaviors and placing them into a concentrated environment of only themselves.\nIf shooting oneself in the foot was considered a good thing, then FUSD could qualify as a world-class marksman regarding this issue. If FUSD really wanted to practice restorative justice, it would bring JEY back to its previous stature. Maybe Larry Powell could help.\nWilliam (Bill) Larkin monitors online credit-recovery classes in the Apex program. He taught in the JEY program for eight years. Connect with him at William.Larkin@fresnounified.org.", "orig_sample_length": 668, "prompt_length": 201, "real_completion_length": 467, "no_bl_gen_time": 10.31766963005066, "w_bl_gen_time": 12.585313081741333, "no_bl_output": " best way to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "w_bl_output": " same as well known as well known as well as well as well as well as well as well as well as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible. so far as possible.", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.05184758608065658, "no_bl_tok_per_sec": 19.287301021967586, "w_bl_sec_per_tok": 0.06324277930523282, "w_bl_tok_per_sec": 15.812081805792145, "baseline_loss": 5.9946980476379395, "baseline_ppl": 401.2955017089844, "no_bl_loss": 1.8507046699523926, "no_bl_ppl": 6.364302635192871, "w_bl_loss": 1.9256035089492798, "w_bl_ppl": 6.859287261962891}
{"idx": 29, "truncated_input": "This was Reinsdorf's reply on Friday when asked whether the preseason announcement that Phil Jackson will not return as coach of the Bulls next season is, as the French saying goes, a fact accomplished.\nAnd the notation on the desk of Reinsdorf, the owner of the Chicago Bulls, also indicates his position regarding Michael Jordan's often-stated contention that he will play for no other coach than Jackson, and he will play for no other team than the Bulls, which would mean no Jordan filling up the nets next season.\nThe Bulls make their final regular-season appearance at Madison Square Garden this afternoon against the Knicks, and it seems inconceivable that Jordan will not return for yet another year, and that neither Jackson nor Scottie Pippen will be with the Bulls, either.\nJordan, still the world's greatest hoopster, is leading the National Basketball Association in scoring for the 10th time in his 14 seasons. Even at age 35, he is playing as good", "baseline_completion": " an all-round game as ever. Fans, players and team executives know this, so it can hardly be lost on Jordan himself.\nIt is also obvious that His Airness -- a little less airy these days and a little more earthy but ever sovereign -- is having a grand time at his occupation, and satisfying that remarkable lust for competition and success that has made him an indomitable basketball player.\nJordan has changed his mind before, remember. He quit basketball to play baseball and quit baseball to play basketball.\nBut hadn't decisions already been made? As recently as early February, Jerry Krause, the Bulls' general manager, reiterated that Jackson would not return next season, after having led the Bulls to five championships and, if the best-laid plans of Krause and his men do not go awry, to a sixth come June.\nThe personality, or perhaps ego, clash between Jackson and Krause is no secret. While he hired Jackson, Krause also believes that after a certain time, a general manager and a coach may tire of each other, as, has been said, Jerry West and Pat Riley did with the Lakers, thereby compelling a change.\nIn fact, personality clashes between Krause and some of his players, including Pippen and Jordan, and assistant coaches over the years have been no secret. It seems, however, that Krause has had no such conflict with the owner of the team. But it also seems clear that Reinsdorf has sought for Krause and staff to zipper their lips in regard to what may transpire at season's end.\nStill, Reinsdorf's respect for Krause as a basketball operative is lofty, and for good reason. Krause became general manager in 1985, the year after Jordan was drafted. Six seasons later, the Bulls won the first of their championships.\n''Everyone on the first championship team except Jordan was acquired by Krause,'' Reinsdorf said. That included Pippen, astutely attained in a trade for his draft rights and now seemingly headed elsewhere next season as a free agent, although who knows for sure.\nPippen, who will be 33 in September, doesn't talk to Krause, but he does talk to Reinsdorf. And while Pippen is said to be seeking a huge five-year contract, Reinsdorf said he had yet to hear anything like that from Pippen, who has been bitter about what the Bulls have been paying him but has also been making plenty of money with endorsements.\nKrause took a chance on Dennis Rodman. He found a place for Steve Kerr. He traded a nonentity, Stacey King, for center Luc Longley. He traveled for years to Europe to court Toni Kukoc, and finally snared him. He saw the possibilities in Ron Harper's career being revived.\nYes, Krause has had Jordan all this time, but Jordan found that he couldn't do it alone. He didn't win his first championship until his seventh season in the league -- with a requisite ''supporting cast,'' as Jordan termed it.\nKrause has surely made mistakes, too, such as some draft picks.\nKrause, meanwhile, sometimes says things without a veneer of suavity. He can rankle in his bluntness, or, sometimes, in his evasiveness. And possibly he is frustrated in not receiving much of the due he believes he deserves.\nWhen he received his championship ring for last season along with the rest of the team at the season opener at the United Center, the boos for him were evident. It was odd, since if he had been the general manager of five championships in, say, New York, he could be Mayor of this town -- and on a write-in ballot.\nSo at what point do you make a decision to break up the team?\nLooking at their history, it is manifest that as a twosome neither Krause nor Reinsdorf is so stupid or driven by ego that he will perpetrate the sublimely imbecilic.\nThe view here is that Jordan will definitely be playing next season with the Bulls, with or without Jackson. But the odds of Jackson returning appear healthy, as well, especially if the Bulls win another title.\nIf there is one exception to ''Nothing is written in stone,'' it is this: It's a bottom-line game.", "orig_sample_length": 1114, "prompt_length": 201, "real_completion_length": 913, "no_bl_gen_time": 10.29922366142273, "w_bl_gen_time": 12.584280967712402, "no_bl_output": " enough to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able", "w_bl_output": " to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.05175489277096849, "no_bl_tok_per_sec": 19.32184468868115, "w_bl_sec_per_tok": 0.06323759280257489, "w_bl_tok_per_sec": 15.81337865155554, "baseline_loss": 6.003515243530273, "baseline_ppl": 404.84942626953125, "no_bl_loss": 1.7955002784729004, "no_bl_ppl": 6.022486686706543, "w_bl_loss": 1.80181884765625, "w_bl_ppl": 6.0606608390808105}
{"idx": 30, "truncated_input": "(HOST) As the season for summer blockbuster movies about super heroes and rings of power approaches, commentator Willem Lange is feeling nostalgic for other mighty champions of yesteryear.\nearly western United States. Nowhere in the pages of history can one find a greater champion of justice. Return with us now to those thrilling days of yesteryear. From out of the past come the thundering hoof beats of the great horse Silver! The Lone Ranger rides again!\"\nHow many times I must have heard those lines, and how impressive they must have been, to be remembered 70 years later?\nmeans stupid in Spanish? What did kemo sabe mean? – boss, or pal, or champion of justice, or paleface idiot?\nWhen I was little, there was no radio in our house; our parents were deaf. Our grandparents had a big table-model Philco in their parlor. Just as kids nowadays tease for an iPhone, I kept asking for", "baseline_completion": " a radio until I got it. A tiny, dark-brown Bakelite-cased Arvin, it sat on the sideboard in our dining room.\nEvery weekday, from 4:45 till 6:00 in the afternoon, I pulled my long-legged chair up to the sideboard, turned on the radio, and gazed at the dial. Many of you must remember \"watching the radio\" and memorizing the numbers of the AM dial, from 520 to 1610 kilohertz. I could tell from the glances I got from my parents as I sat there – sitting still for longer than at any other time in my life – that they suspected I was listening to something inappropriate and possibly sinful.\nAt 4:45 a voice crackled over a simulated radio transmission: \"CX4 to control tower. CX4 to control tower. Standing by…\" The answer was immediate: \"Control tower to CX4. Wind southeast, ceiling 1200. All clear.\"\n\"This is Hop Harrigan, coming in!\" So it went: five 15-minute episodes, featuring Jack Armstrong, Captain Midnight; Terry and the Pirates, and finally Tom Mix.\nEvenings, there were half-hour shows – The Green Hornet; The Shadow, in real life Lamont Cranston, \"wealthy young man-about-town\" who once in the Orient had learned to \"cloud men’s minds so they cannot see him.\"\nEverything we imagined was the product of our separate minds’ eyes. When the Lone Ranger walked across the board platform of a railroad station, each of us constructed a different scene. It was like the famous \"driveway moments\" on Public Radio; you could do nothing else demanding thought while you were into an on-air drama. Listening to archived recordings now reveals it to have been pretty simplistic drivel. Still, wasn’t it glorious!\n(TAG) You can find more commentaries by Willem Lange at VPR-dot-net.", "orig_sample_length": 611, "prompt_length": 201, "real_completion_length": 410, "no_bl_gen_time": 10.309487342834473, "w_bl_gen_time": 12.574575901031494, "no_bl_output": " a few months ago, but I’s of course of course, but I’s of course, but I’s of course, I’s of course, I’s of course, I’s of course, I’s of course, I’s of course, I’s of course, I’s of course, I’s of course, I’s of course, I’s of course, I’s of course,’s of course, I’s of course, I’s of course, I’s of course, I’s of course, I’s of course, I’s of course, I’s of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course,", "w_bl_output": " a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.051806469059469715, "no_bl_tok_per_sec": 19.302608692595502, "w_bl_sec_per_tok": 0.06318882362327384, "w_bl_tok_per_sec": 15.825583428517538, "baseline_loss": 6.294777870178223, "baseline_ppl": 541.7354736328125, "no_bl_loss": 1.9349353313446045, "no_bl_ppl": 6.923596382141113, "w_bl_loss": 1.617318868637085, "w_bl_ppl": 5.039560317993164}
{"idx": 34, "truncated_input": "No, Trump can’t pardon himself. The Constitution tells us so.\nCorrection: An earlier version of this op-ed misspelled the name of former defense secretary Caspar Weinberger. This version has been updated.\nLaurence H. Tribe is the Carl M. Loeb University Professor and Professor of Constitutional Law at Harvard Law School. Richard Painter, a law professor at the University of Minnesota, was chief White House ethics lawyer for President George W. Bush from 2005 to 2007 and is vice-chair of Citizens for Responsibility and Ethics in Washington (CREW). Norman Eisen, a senior fellow at the Brookings Institution, was chief White House ethics lawyer for President Barack Obama from 2009 to 2011 and is chair of CREW.\nCan a president pardon himself? Four days before Richard Nixon resigned, his own Justice Department’s Office of Legal Counsel opined no, citing “the fundamental rule that no one may be a judge in his own case.” We agree", "baseline_completion": ".\nThe Justice Department was right that guidance could be found in the enduring principles that no one can be both the judge and the defendant in the same matter, and that no one is above the law.\nThe Constitution specifically bars the president from using the pardon power to prevent his own impeachment and removal. It adds that any official removed through impeachment remains fully subject to criminal prosecution. That provision would make no sense if the president could pardon himself.\nThe pardon provision of the Constitution is there to enable the president to act essentially in the role of a judge of another person’s criminal case, and to intervene on behalf of the defendant when the president determines that would be equitable. For example, the president might believe the courts made the wrong decision about someone’s guilt or about sentencing; President Barack Obama felt this way about excessive sentences for low-level drug offenses. Or the president might be impressed by the defendant’s subsequent conduct and, using powers far exceeding those of a parole board, might issue a pardon or commutation of sentence.\nOther equitable considerations could also weigh in favor of leniency. A president might choose to grant a pardon before prosecution of a person when the president believes that the prosecution is not in the national interest; President Gerald Ford pardoned Nixon in part for this reason.\nOr a president may conclude that even if a person may have committed a crime, he was acting in good faith to protect the national interest; President George H.W. Bush pardoned former defense secretary Caspar Weinberger in the Iran-contra affair in part for this reason.\nIn all such instances, however, the president is acting as a kind of super-judge and making a decision about someone else’s conduct, the justice of someone else’s sentence or whether it is in the national interest to prosecute someone else. He is not making a decision about himself.\nThe Constitution embodies this broad precept against self-dealing in its rule that congressional pay increases cannot take effect during the Congress that enacted them, in its prohibition against using official power to gain favors from foreign states and even in its provision that the chief justice, not the vice president, is to preside when the Senate conducts an impeachment trial of the president.\nThe Constitution’s pardon clause has its origins in the royal pardon granted by a sovereign to one of his or her subjects. We are aware of no precedent for a sovereign pardoning himself, then abdicating or being deposed but being immune from criminal process. If that were the rule, many a deposed king would have been spared instead of going to the chopping block.\nWe know of not a single instance of a self-pardon having been recognized as legitimate. Even the pope does not pardon himself. On March 28, 2014, in St. Peter’s Basilica, Pope Francis publicly kneeled before a priest and confessed his sins for about three minutes.\nPresident Trump thinks he can do a lot of things just because he is president. He says that the president can act as if he has no conflicts of interest. He says that he can fire the FBI director for any reason he wants (and he admitted to the most outrageous of reasons in interviews and in discussion with the Russian ambassador). In one sense, Trump is right — he can do all of these things, although there will be legal repercussions if he does. Using official powers for corrupt purposes — such as impeding or obstructing an investigation — can constitute a crime.\nBut there is one thing we know that Trump cannot do — without being a first in all of human history. He cannot pardon himself.\nElizabeth Holtzman: In the Russia probe, could Trump pardon himself?\nDana Milbank: Trump can do whatever he wants. God help us.", "orig_sample_length": 972, "prompt_length": 201, "real_completion_length": 771, "no_bl_gen_time": 10.326745510101318, "w_bl_gen_time": 12.527502536773682, "no_bl_output": " to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "w_bl_output": " to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.051893193518097076, "no_bl_tok_per_sec": 19.270349967019527, "w_bl_sec_per_tok": 0.0629522740541391, "w_bl_tok_per_sec": 15.885049666990547, "baseline_loss": 5.624382972717285, "baseline_ppl": 277.10125732421875, "no_bl_loss": 1.836179494857788, "no_bl_ppl": 6.272528171539307, "w_bl_loss": 1.836179494857788, "w_bl_ppl": 6.272528171539307}
{"idx": 36, "truncated_input": "Jerry Springer says he is still deciding whether he will run for Ohio governor in 2018.\nSpeculation around Springer’s potential gubernatorial bid has been growing for several months.\nThe Enquirer also reported Wednesday that Springer is soliciting feedback from Ohio State Sen. Sandra Williams, Democratic Reps. Janine Boyd and Stephanie Howse, and political consultants.\n“Glad to be in attendance @ rep’s Stephanie Howse and Janine Boyd fundraiser w/Jerry Springer, possible candidate for Gov. of Ohio,” Williams tweeted Tuesday.\n“He’s very serious,” Williams said of Springer’s interest in running, in an interview with Cleveland.com.\nThe fundraiser was held at Nighttown, a Cleveland Heights jazz club and restaurant.\nRing said Springer gave a brief speech at the fundraiser.\nSpringer, 73, previously considered running for US Senate in 2000 and 2004, but decided against it.\nHe has previously attributed", "baseline_completion": " the rumors around his potential bid for governor to former reality TV star Donald Trump’s successful White House bid.\nBut people continued to discuss Springer’s potential return to politics.\nIn late May, Business Insider, citing more than half a dozen Democrats familiar with the race, reported influential Ohio Democrats — including former Ohio Gov. Ted Strickland and Hamilton County Democratic Party Chairman Tim Burke — pushed for Springer to run.\nIn an interview with CNN’s Brooke Baldwin in May of 2016, Springer — who supported Democrat Hillary Clinton in 2016 — was seemingly unsurprised by Trump’s popularity. He said that since President Ronald Reagan, a generation of Americans has grown up believing government is the problem in America.\n“The celebrity in politics was inevitable,” Springer said.\nSince Trump’s win, a growing number of celebrities have expressed interest in running for office, or have not ruled out pursuing politics in the future.\n“I think it’s a real possibility,” Johnson told the publication when asked if he would ever run.\nIn July, a West Virginia resident created a campaign committee called “Run The Rock 2020” to draft Johnson as a presidential candidate in 2020.\nMusician Kid Rock teased a potential bid for US Senate, but ultimately used the social media hype around the buzz to announce his non-profit designed to promote voter registration.", "orig_sample_length": 489, "prompt_length": 201, "real_completion_length": 288, "no_bl_gen_time": 10.299820184707642, "w_bl_gen_time": 12.571171283721924, "no_bl_output": " to", "w_bl_output": " to", "no_bl_num_tokens_generated": 1, "w_bl_num_tokens_generated": 1, "no_bl_sec_per_tok": 10.299820184707642, "no_bl_tok_per_sec": 0.09708907360195675, "w_bl_sec_per_tok": 12.571171283721924, "w_bl_tok_per_sec": 0.07954708256142158, "baseline_loss": 5.606359481811523, "baseline_ppl": 272.15167236328125, "no_bl_loss": 0.2250566929578781, "no_bl_ppl": 1.2523937225341797, "w_bl_loss": 0.2250566929578781, "w_bl_ppl": 1.2523937225341797}
{"idx": 37, "truncated_input": "It’s a continuation of a trend they have seen over the last several years.\n“It’s been almost three years of nothing but above normal temperatures for the most part,” Zierden told the Bradenton Herald in a phone inteview Monday.\nHe noted that the last 21 consecutive months have all been warmer than what is considered normal.\nTampa is one of the weather stations showing a record warm ranking, according to a second tweet from Zierden.\nAccording to the Florida Climate Center, the average temperature in Tampa during November was 72.1 degrees, three degrees warmer than normal.\nMost of the state exhibited a similar, warmer-than-normal trend.\n“All of that is consistent with what other parts of the world have seen and what we expect with climate change, and so I would certainly think climate change has its fingerprints on the recent trend of above-normal temperatures,” Zierden said.\nIn", "baseline_completion": " Manatee County, there were nine record-setting high temperatures through November, according to NCEI daily weather records. Six days through November tied for record- high temperatures.\nHowever, Zierden cautioned, just because the average temperatures have been warmer doesn’t mean Florida won’t see cold snaps this winter.\nAcross the country, it’s been an above-average year for temperatures, the report from the National Centers for Environmental Information shows.\nThe year-to-date U.S. average temperature, 56.4 degrees, was the third warmest on record. That’s 2.61 degrees above the 20th century average, according to the NCEI.\nThe warmest year on record for the U.S. was 2012, when the average temperature through November was 57.04 degrees, NCEI archives show.\nSpectrum Bay News 9 Meteorologist Josh Linker said average temperatures will likely remain above average at least through Christmas, but just by a couple of degrees each day. Temperatures, however, return to average for the last few days of the year.\nLinker said December is currently averaging less than 1 degree above normal, due in part to a recent week of cooler weather.", "orig_sample_length": 458, "prompt_length": 201, "real_completion_length": 257, "no_bl_gen_time": 10.317381620407104, "w_bl_gen_time": 12.557920455932617, "no_bl_output": " addition to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able", "w_bl_output": " addition to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.0518461387960156, "no_bl_tok_per_sec": 19.287839426855264, "w_bl_sec_per_tok": 0.06310512791925939, "w_bl_tok_per_sec": 15.846572742542604, "baseline_loss": 5.642161846160889, "baseline_ppl": 282.0718688964844, "no_bl_loss": 1.748058795928955, "no_bl_ppl": 5.743442535400391, "w_bl_loss": 1.748058795928955, "w_bl_ppl": 5.743442535400391}
{"idx": 43, "truncated_input": "The Congress of South African Trade Unions has noted the latest cabinet reshuffle by President Jacob Zuma. We can confirm that the federation did receive a courtesy call from President Jacob Zuma regarding his decision to reshuffle his cabinet this morning.\nWhile, we acknowledge that the president of the republic has a prerogative to reshuffle his National Executive as per the Constitution of the republic, we find the frequency of these cabinet reshuffles unsettling because they do not help to create the much needed stability at a government level. What compounds the situation is that some of these government departments are also witnessing an exodus of senior technocrats.\nAll of this is happening while workers and the poor are continuing to be victims of a system that has condemned millions of our fellow citizens to lives of brute survival. Our economy is currently haemorrhaging jobs at an alarming rate and it does not help that we are also experiencing this kind of political uncertainty and policy incoherence from government.\nCOSATU", "baseline_completion": " expects cabinet reshuffles to be about strengthening the capacity of government in order to help government to better implement its developmental agenda and deliver on its promises. We are not convinced that this reshuffle is informed by that ,considering that some of the most ineffectual ministers like Minister Bathabile Dlamini, Minister Nomvula Mokonyane, and Minister Mosebenzi Zwane are still part of the National Executive.\nThese recent cabinet reshuffles have done very little to help take the National Democratic Revolution forward. We call on the African National Congress to reflect deeply about the state of the economy and the overall performance of its government. The majority of workers are facing a bleak future and the people South Africa need a clear sign that the government has a plan to rescue them from poverty and kick-start this economy.\nAs COSATU , we will continue to work with and support the newly elected ministers and deputy ministers with the hope that they will prioritise a people driven and people centred development. We wish them well in their new positions.", "orig_sample_length": 418, "prompt_length": 201, "real_completion_length": 217, "no_bl_gen_time": 10.295480012893677, "w_bl_gen_time": 12.589866876602173, "no_bl_output": ". to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able", "w_bl_output": ". so that they have to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.0517360804668024, "no_bl_tok_per_sec": 19.328870509270068, "w_bl_sec_per_tok": 0.06326566269649334, "w_bl_tok_per_sec": 15.806362525550968, "baseline_loss": 5.880207538604736, "baseline_ppl": 357.8835144042969, "no_bl_loss": 1.787467360496521, "no_bl_ppl": 5.974302768707275, "w_bl_loss": 1.819586992263794, "w_bl_ppl": 6.169310092926025}
{"idx": 45, "truncated_input": "After much anticipation, Melania Trump has finally given the world a glimpse of her platform.\nLike those before her, Trump is keen to make a difference in her own unique way. Speaking in the Rose Garden, she officially launched \"Be Best,\" which tackles three key pillars: well-being, social media and opioid abuse.\nBut what does it take to be effective as first lady, especially amid an ever moving spectrum of expectations, responsibility and public opinion?\nThe first lady's communications director, Stephanie Grisham, recently stated that most first ladies have focused on a single issue. In fact, several presidential spouses in the last century have taken on multiple causes, and Trump can look to them for guidance. To be successful, here are three recommendations from the Bush Institute's report \"A Role Without a Rulebook\" that Trump should consider implementing.\n1. Develop a strategic vision.\nAs first lady, Trump is uniquely positioned to be a compassionate listener and supportive facilitator. As she", "baseline_completion": " develops this platform, she should clearly define actionable goals that engage citizens at local and national levels.\nShe can look to her peer, Laura Bush, who launched \"Ready to Read, Ready to Learn\" with two clear objectives in mind: to ensure young children are prepared when they enter their first classroom, and once there have well-trained, qualified teachers. She also addressed how these goals would be achieved. By outlining a clear mission alongside defined actions, Bush was able to make progress on these goals during her time as first lady.\n2. Engage with citizens and peers.\nIn a polarized political climate, Trump must embrace the opportunity to transcend boundaries. Unelected but official, she is able to build bridges between government and civil society. For example, one of our most prominent first ladies, Eleanor Roosevelt, championed causes including racial equality, labor rights and women's rights, and she was the first presidential spouse to testify before a congressional committee. Central to her efforts: community and stakeholder outreach.\nEngagement with predecessors and peers can also aid Trump's efforts. For example, longstanding advocates for mental health and those battling addictive diseases, Rosalynn Carter and Betty Ford joined forces to advance policy and increase support for services. Reflecting on their collaboration, Carter said: \"(Betty and I) could be a stronger force if we worked as partners, and we did for many years.\"\nTrump has the opportunity to use the power of partnership. As political influences, first ladies can reach across industries and ideologies to unite diverse viewpoints and mobilize action. For example, Michelle Obama and Jill Biden launched \"Joining Forces,\" working with the public and private sectors to improve outcomes for service members, veterans and their families by providing the tools needed to succeed throughout their lives.\nWhile the role of first lady is one without a rulebook, these are proven actions that can aid Trump's efforts on a variety of platforms. When used effectively, a first lady's podium serves as a force for change.\nNatalie Gonnella-Platts is the deputy director of the Women's Initiative at the George W. Bush Institute and co-author of \"A Role Without a Rulebook: The Influence and Leadership of Global First Ladies.\" She wrote this for InsideSources.com.", "orig_sample_length": 662, "prompt_length": 201, "real_completion_length": 461, "no_bl_gen_time": 10.332786798477173, "w_bl_gen_time": 12.627453327178955, "no_bl_output": " can be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "w_bl_output": " can be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.05192355175114157, "no_bl_tok_per_sec": 19.259083138087032, "w_bl_sec_per_tok": 0.06345453933255757, "w_bl_tok_per_sec": 15.759313841349016, "baseline_loss": 5.977813720703125, "baseline_ppl": 394.5767822265625, "no_bl_loss": 1.8248696327209473, "no_bl_ppl": 6.201986312866211, "w_bl_loss": 1.8248696327209473, "w_bl_ppl": 6.201986312866211}
{"idx": 46, "truncated_input": "OKLAHOMA CITY - Kevin Durant scored 25 points, James Harden added a spark with 23 points off the bench while returning from an injury and the Oklahoma City Thunder ended a string of futility against the Houston Rockets with a 122-104 victory.\nThe Thunder got out to a sizzling start and opened a 23-point lead within the first 14 minutes. Their lead was never in jeopardy against a Houston team desperately needing a late charge to make the playoffs.\nInstead, Oklahoma City used its second-best shooting performance of the season to take a big step toward solidifying its spot in the postseason.\nLuis Scola scored 25 and Trevor Ariza added 20 points for Houston, which fell seven games behind Oklahoma City and 51/2 behind eighth-place Portland in the Western Conference.\nBOSTON - Paul Pierce scored 27 points, Kevin Garnett had 20 and the Boston Celtics clinched a playoff berth with a win over the Denver Nuggets.\nThe Celtics dominated inside and", "baseline_completion": " the Nuggets, one day after losing to the Knicks in New York, slipped a half-game behind the Dallas Mavericks and into a third-place tie with Utah in the Western Conference with their third consecutive loss.\nBoston led by 21 points twice in the third quarter before Denver cut the lead to 87-80 going into the fourth. But the Celtics stayed ahead by seven to 16 the rest of the way for their fifth win in six games. Rajon Rondo had a triple-double with 11 points, 15 assists and 11 rebounds.\nCarmelo Anthony led Denver with 32 points and J.R. Smith added 21.\nTORONTO - Deron Williams had 18 points, 16 assists and eight rebounds, leading the Utah Jazz to victory over the Toronto Raptors.\nCarlos Boozer added 18 points and 11 rebounds, while Mehmet Okur and rookie Wesley Matthews had 16 points apiece for the Jazz, who won their third straight. Seven Jazz players finished with at least 12 points.\nChris Bosh celebrated his 26th birthday with a 20-point performance for the Raptors (35-35), who fell 11/2 games behind Charlotte and Miami in the race for sixth place in the Eastern Conference.\nAntoine Wright had 10 of his 15 points in the second quarter for the Raptors, while Andrea Bargnani added 12 and Jose Calderon 10.\nATLANTA - Josh Smith swooped in to slam through Joe Johnson's missed shot just ahead of the buzzer and the Atlanta Hawks finally beat the Orlando Magic, clinching a third straight trip to the playoffs.\nThe Hawks bounced back from an early 15-2 deficit and overcame going 8:45 in the fourth quarter without a field goal against a division rival that had routed them three times this season. For Atlanta, it came down to the final shot of regulation for the fifth straight game.\nINDIANAPOLIS - Danny Granger scored 31 points to help the Indiana Pacers beat the Washington Wizards and extend Washington's losing streak to a franchise record-tying 13 games.\nAndray Blatche started for the Wizards a night after he was benched for most of the game following a spat with coach Flip Saunders.\nThe Wizards last lost 13 straight in 1995. They can set a record for futility Friday at Charlotte.\nIt was Granger's third straight game with at least 30 points. Josh McRoberts had 14 points and a career-high 12 rebounds for the Pacers, who have won four in a row overall and six straight at home.\nCHARLOTTE, N.C. - Stephen Jackson shook off a sore hand and busted out of his shooting slump with 37 points, leading the Charlotte Bobcats past Minnesota to send the reeling Timberwolves to their 14th straight loss.\nJackson, who a night earlier revealed he had been plagued by a bruised ligament near his left index finger, hit 15-of-24 shots after shooting 37 percent in the previous 10 games. Gerald Wallace added 23 points as the Bobcats shot 54 percent from the field and moved into sixth place in the Eastern Conference with their sixth straight home win.\nAl Jefferson scored 21 points for the Timberwolves, who came apart in a 20-0 Charlotte run in the second quarter to drop to 5-32 on the road.\nEAST RUTHERFORD, N.J. - Brook Lopez had 26 points and 13 rebounds, and New Jersey Nets moved a step closer to avoiding a dubious date with NBA history by beating the Sacramento Kings to snap an eight-game losing streak and a franchise-record, 14-game skid at home.\nDevin Harris added 24 points and nine assists for the Nets (8-63), who need to win once in their last 11 games to avoid breaking the league mark for fewest wins in a season (9-73), set by the Philadelphia 76ers in 1972-73.\nNets interim coach Kiki Vandeweghe guided the team despite learning of the death of his mother, former Miss America Colleen Kay Hutchins, earlier in the day.\nBeno Udrih had 19 points for the Kings, who lost the eighth time in 11 games.\nMILWAUKEE - Rookie Jrue Holiday had 15 points and seven assists, leading the Philadelphia 76ers to a victory over the Bucks that snapped Milwaukee's longest home winning streak in six years at eight games.\nIt was a dismal display for Milwaukee, which had won 15 of the last 17 to virtually assure a postseason berth for the first time since 2006.\nInstead, Samuel Dalembert had 12 points and 10 rebounds, Willie Green scored 16 points and Andre Iguodala 14 as the Sixers poured it on for their third win in the last 16 games.\nJerry Stackhouse scored 15 points and rookie Brandon Jennings added 12 for Milwaukee, but the Bucks shot 5 of 28 from 3-point range and led only once in the game, 3-0.\nNEW ORLEANS - LeBron James scored an efficient 38 points on 15 of 22 shooting to go with nine assists, and the Cleveland Cavaliers won their eighth straight game, over the New Orleans Hornets.\nJ.J. Hickson scored 20 for the Cavs, who led by as many as 17 and never trailed after James' floater tied it at 10 in the first quarter. Delonte West added 15 points and Antawn Jamison had 11 points and 11 rebounds as Cleveland won its 27th straight over a team with a losing record.\nMarcus Thornton scored 20 points and Darren Collison added 17 for the Hornets, who will be eliminated from the playoffs if Portland wins today. David West added 16 points.", "orig_sample_length": 1344, "prompt_length": 201, "real_completion_length": 1143, "no_bl_gen_time": 10.343345403671265, "w_bl_gen_time": 12.563125610351562, "no_bl_output": " a lot of the last year’s of the world’s’s of the world’s of the world’s of the world’s of the world’s’s’s’s’s’s.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n’s’s\n\n\n\n\n\n’s\n\n\n\n\n’s’s\n\n\n\n\n\n’s\n\n\n\n’s\n\n\n\n’s\n\n\n\n’s\n\n\n\n’s\n\n\n\n’s\n\n\n\n\n’s\n\n\n\n’s\n\n\n\n\n’s\n\n\n\n’s\n\n\n\n\n’\n’s\n\n\n\n’\n\n", "w_bl_output": " a few days later in a few days later in a few days of a few days of a few weeks worth of a few days later in a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.05197661006869982, "no_bl_tok_per_sec": 19.239423245922637, "w_bl_sec_per_tok": 0.06313128447412845, "w_bl_tok_per_sec": 15.840007190251379, "baseline_loss": 5.897341728210449, "baseline_ppl": 364.0683898925781, "no_bl_loss": 4.420151710510254, "no_bl_ppl": 83.10889434814453, "w_bl_loss": 1.6512205600738525, "w_bl_ppl": 5.213339328765869}
{"idx": 48, "truncated_input": "1 Then the people of the land took Jehoahaz the son of Josiah, and made him king in his father's stead in Jerusalem.\n2 Joahaz was twenty and three years old when he began to reign; and he reigned three months in Jerusalem.\n3 And the king of Egypt deposed him at Jerusalem, and fined the land a hundred talents of silver and a talent of gold.\n4 And the king of Egypt made Eliakim his brother king over Judah and Jerusalem, and changed his name to Jehoiakim. And Neco took Joahaz his brother, and carried him to Egypt.\n5 Jehoiakim was twenty and five years old when he began to reign; and he reigned eleven years in Jerusalem: and he did that which was evil in the sight of Jehovah his God.\n6 Against him came up Nebuchadnezzar king of Babylon, and bound him in fetters, to carry him to Babylon.", "baseline_completion": "\n7 Nebuchadnezzar also carried of the vessels of the house of Jehovah to Babylon, and put them in his temple at Babylon.\n8 Now the rest of the acts of Jehoiakim, and his abominations which he did, and that which was found in him, behold, they are written in the book of the kings of Israel and Judah: and Jehoiachin his son reigned in his stead.\n9 Jehoiachin was eight years old when he began to reign; and he reigned three months and ten days in Jerusalem: and he did that which was evil in the sight of Jehovah.\n10 And at the return of the year king Nebuchadnezzar sent, and brought him to Babylon, with the goodly vessels of the house of Jehovah, and made Zedekiah his brother king over Judah and Jerusalem.\n12 and he did that which was evil in the sight of Jehovah his God; he humbled not himself before Jeremiah the prophet [speaking] from the mouth of Jehovah.\n13 And he also rebelled against king Nebuchadnezzar, who had made him swear by God: but he stiffened his neck, and hardened his heart against turning unto Jehovah, the God of Israel.\n14 Moreover all the chiefs of the priests, and the people, trespassed very greatly after all the abominations of the nations; and they polluted the house of Jehovah which he had hallowed in Jerusalem.\n16 but they mocked the messengers of God, and despised his words, and scoffed at his prophets, until the wrath of Jehovah arose against his people, till there was no remedy.\n17 Therefore he brought upon them the king of the Chaldeans, who slew their young men with the sword in the house of their sanctuary, and had no compassion upon young man or virgin, old man or hoary-headed: he gave them all into his hand.\n18 And all the vessels of the house of God, great and small, and the treasures of the house of Jehovah, and the treasures of the king, and of his princes, all these he brought to Babylon.\n19 And they burnt the house of God, and brake down the wall of Jerusalem, and burnt all the palaces thereof with fire, and destroyed all the goodly vessels thereof.\n21 to fulfil the word of Jehovah by the mouth of Jeremiah, until the land had enjoyed its sabbaths: [for] as long as it lay desolate it kept sabbath, to fulfil threescore and ten years.\n23 Thus saith Cyrus king of Persia, All the kingdoms of the earth hath Jehovah, the God of heaven, given me; and he hath charged me to build him a house in Jerusalem, which is in Judah. Whosoever there is among you of all his people, Jehovah his God be with him, and let him go up.", "orig_sample_length": 800, "prompt_length": 201, "real_completion_length": 599, "no_bl_gen_time": 10.356080770492554, "w_bl_gen_time": 12.55535078048706, "no_bl_output": " so far more than a few months later on the last year old man’s’s of a few years old man’s’s’s of a few years old man’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’s’", "w_bl_output": " so that is a few days of a few days of a few days of a few days later in a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.05204060688689725, "no_bl_tok_per_sec": 19.215763608855593, "w_bl_sec_per_tok": 0.06309221497732191, "w_bl_tok_per_sec": 15.849816024995215, "baseline_loss": 5.566629886627197, "baseline_ppl": 261.5511474609375, "no_bl_loss": 1.984979510307312, "no_bl_ppl": 7.278898239135742, "w_bl_loss": 1.6592707633972168, "w_bl_ppl": 5.255476951599121}
{"idx": 51, "truncated_input": "Roger Federer of Switzerland and Bill Gates shake hands at the Match For Africa 4 exhibition match at KeyArena on April 29, 2017 in Seattle, Washington.\nWhen I was in my 20s and early 30s, my whole life was focused on work. I didn’t take vacations or weekends off. I was always the first in the office and the last to leave. These days, I’m better at balancing the work that I love to do with my foundation and taking time off to spend with family and friends.\nMy parents first taught me bridge, but I really started to enjoy it after playing with Warren Buffett. It takes a mix of strategy and teamwork to do well. We always find time to play a few games when we’re together.\nThis civilization-building board game is a favorite in my family. Melinda, our kids, and I have spent many hours sitting around the table trading resources, building roads, and strategizing to be the", "baseline_completion": " first to reach 10 victory points.\nI have played tennis my whole life. This year, I got to play a match with Roger Federer to help raise money for his foundation. I wouldn’t say it was the most relaxing tennis game I’ve ever played, but it was a whole lot of fun.\nIt may not be too surprising that one of my favorite ways to relax is to keep learning. On average, I try to read a book a week, and I always bring a whole tote bag of them on vacation.\nIn 1993, Melinda and I visited Tanzania, Kenya, and Zaire (now the Democratic Republic of Congo). That trip changed our lives and inspired us to start our foundation and get involved in philanthropy sooner than we planned. I know it’s not possible for everyone to travel halfway around the world, so I’ve started sharing VR videos on my Gates Notes blog of what I’m seeing and learning.", "orig_sample_length": 401, "prompt_length": 201, "real_completion_length": 200, "no_bl_gen_time": 10.296931743621826, "w_bl_gen_time": 12.596649408340454, "no_bl_output": " end up to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "w_bl_output": " same as well known as well known as well as well as well as well as well as well as well as well as well as well as possible. as possible. as possible. as possible. as possible. as possible. as possible. as possible. as possible. as possible. as possible. as possible. as well as possible. as possible. as possible. as possible. as possible. as well as possible. as possible. as possible. as possible. as possible.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis is one of course, as well as possible.\n\n\n\n\n\n\n\n\n\n\n\nYou can be sure, as well as possible.\n\n\n\n\n\n\n\n\n\n\n", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 165, "no_bl_sec_per_tok": 0.05174337559608958, "no_bl_tok_per_sec": 19.326145395036296, "w_bl_sec_per_tok": 0.07634332974751791, "w_bl_tok_per_sec": 13.098721306854085, "baseline_loss": 5.213155746459961, "baseline_ppl": 183.6727752685547, "no_bl_loss": 1.7238235473632812, "no_bl_ppl": 5.605922222137451, "w_bl_loss": 2.9990081787109375, "w_bl_ppl": 20.06562614440918}
{"idx": 52, "truncated_input": "Elvis Costello played a two-hour, 25-song show that touched on phases throughout his career, both deep cuts and hits, as well as nine of the new disc’s 12 songs. And to the delight of the nearly sold-out crowd, Costello did them all them well.\nOver a career of more than 40 years, singer Elvis Costello has been a punk provocateur, a seminal new wave voice, a contemporary pop singer and even a classic crooner. And there have been fans of each of Costello’s career ventures.\nSo how to satisfy everyone coming to see Costello kick off the North American leg of his latest tour at Sands Bethlehem Event Center to support yet another venture – his very strong new disc “Look Now”?\nOn Friday, Costello did his best to do just that, playing a two-hour, 25-song show that touched on phases throughout his career, both deep cuts and hits, as", "baseline_completion": " well as nine of the new disc’s 12 songs.\nAnd to the delight of the nearly sold-out crowd, Costello did them all well – not afraid to revisit not only the songs of his earlier career, but also carrying the spirit of them into the newer songs.\nPerhaps after surviving cancer surgery that canceled the end of his European leg, the 64-year-old Costello was emboldened, or re-invigorated.\nEither way, his performance, and voice, was stronger than when he played the Sands in 2016.\nBacked by a crack three-man band and two female singers, Costello opened the show with “This Year’s Girl” from his 1978 sophomore disc, “This Year’s Model,” with its swirling synth reviving that new wave sound.\nHe followed that with two 1980s deeper cuts: a forceful “Honey, Are You Straight or Are You Blind,” and “Clubland,” with Costello’s ‘70s rocking edge. On the latter, Costello even held a finger to his nose to hush the crowd as he played a scrubbing lead and sang with a “Watching the Detectives” affect.\nLater offerings from the new disc were even better. The disc’s new single “Under Lime” had very much that 1977 vibe that ushered in new wave. “Why Won’t Heaven Help Me” was pretty rocking. The slow guitar-and-piano “Stripping Paper” was a clear reminder or the Elvis of old, and the slow, sensitive “Suspect My Tears” had some of his best vocals of the night, as he reached for a falsetto.\nEarly in the show, the older songs Costello played were nearly all deeper cuts: “New Lace Sleeves” from 1981’s “Trust”; a rocking, new-wavey “(I Don’t Want to Go To) Chelsea,” with good lead guitar.\nSo that when he did play a hit – his 1977 U.S. breakthrough “Watching the Detectives,” (in the same darkened-stage presentation as the last time he was at the Sands) it got a huge crowd reaction – and deservedly so.\nCostello later did the same with later songs: A largely voice-and-acoustic guitar version of 1986’s “Indoor Fireworks” to a big cheer from the crowd, and closed the main set with a faster, more rocking “Can You Hear Me” from his last disc, 2013’s “Wise Up Ghost” that segued right into the hit “Pump It Up,” thumping, urgent and rocking.\nCostello’s encore stretched eight songs and 40 minutes.\nIt opened with one of the night’s best: a barely instrumented, mostly a cappella “Allison,” with his two female backup singers. It got a huge cheer. Then a stark and spare, piano-and-voice “Accidents Will Happen,” on which he reached for a high and powerful end note.\nHe used that same vocal approach on “I Still Have That Other Girl,” which he also wrote with Bacharach, – really singing it --and paired that with a new Bacharach co-write, “He’s Given Me Things,” from the new disc.\nCostello flubbed the start of that song slightly, and after saying “this is the first night,” re-started it dramatically better. He followed that with another early deeper cut, “Green Shirt,” which started stripped, then built as the crowd clapped along.\nAnd then a six-minute version of his 1979 hit “(What’s So Funny ‘Bout) Peace Love and Understanding,” with a wonderful chorus coda.\nThat completed Costello’s journey of giving everyone what they wanted. The fact that he could do that, and do it as well as he did, shows how important Costello’s music has been, and how much he still has left.", "orig_sample_length": 1108, "prompt_length": 201, "real_completion_length": 907, "no_bl_gen_time": 10.29601764678955, "w_bl_gen_time": 12.567208051681519, "no_bl_output": " well known as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well", "w_bl_output": " well-", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 2, "no_bl_sec_per_tok": 0.05173878214467111, "no_bl_tok_per_sec": 19.327861200981054, "w_bl_sec_per_tok": 6.283604025840759, "w_bl_tok_per_sec": 0.15914433753107127, "baseline_loss": 5.843260765075684, "baseline_ppl": 344.90216064453125, "no_bl_loss": 0.8421191573143005, "no_bl_ppl": 2.3212809562683105, "w_bl_loss": 1.390899658203125, "w_bl_ppl": 4.018463611602783}
{"idx": 53, "truncated_input": "BAGHDAD, Iraq -- Fighting in the Shiite stronghold of Sadr City killed 23 Iraqis yesterday, hospital officials said, and the U.S. military reported five troop deaths, as April showed signs of becoming the worst month for U.S. forces in Iraq since September.\nAt least 11 of the Iraqi deaths occurred when mortar shells landed in residential neighborhoods. Men rushed wounded children to overcrowded emergency rooms in Sadr City hospitals, on foot because of a ban on all vehicular traffic. In some parts of Sadr City, masked militiamen bearing machine guns and grenade launchers remained on the streets.\nOfficials at local hospitals have put the death toll in the neighborhood at more than 70 since Sunday, but it was not clear if those figures included militia fighters.\nThousands of Sadr City residents have fled for other neighborhoods. Prices in local markets were soaring as supplies dwindled, a result of suppliers' inability to bring in goods. Iraqi and U.S. forces appeared to", "baseline_completion": " be penetrating deeper into the neighborhood, one local journalist said.\nThere were no signs that Prime Minister Nouri al-Maliki was pulling back on his offensive against Shiite militias, which has sparked fighting between Iraqi and U.S. forces and militiamen loyal to Shiite cleric Muqtada al-Sadr. Al-Maliki's deadline for fighters to hand in heavy weapons expired Tuesday, but the latest clashes showed that rocket-propelled grenades, mortars, and rockets remained in militia hands.\nBaghdad had spent part of yesterday quieter than in recent days, because of a curfew imposed to prevent clashes and protests marking the anniversary of the fall of Saddam Hussein on April 9, 2003.\nAl-Sadr had called for a huge march in Baghdad to mark the anniversary of Hussein's ouster and to protest the U.S. presence and al-Maliki's offensive. The cleric says the offensive, which began March 25 in the southern city of Basra, is targeting his Mahdi Army and is a ploy to cripple his political movement in advance of provincial elections planned for October.\nHis fighters have risen up against Iraqi and U.S. forces, virtually collapsing a cease-fire that al-Sadr announced last August and that was credited with bringing a sharp drop in violence nationwide.\nAlthough U.S. and Iraqi officials maintain that they are targeting criminal elements or \"special groups\" that did not abide by al-Sadr's truce, U.S. Ambassador Ryan C. Crocker acknowledged yesterday that the Basra offensive had drawn in others.\n\"A dangerous development in the immediate wake of the Basra operation was what appeared to be a reunification between special groups and JAM,\" he told lawmakers in Washington, using the acronym for al-Sadr's militia.\nCrocker and Gen. David Petraeus, commander of U.S. forces in Iraq, gave lawmakers their assessments of the war during two days of hearings in Washington that ended yesterday.\nThe surge in troop deaths since the Basra offensive has underscored their contention that security gains witnessed in recent months easily could be reversed. At least 30 U.S. troops have died in Iraq since the Basra operation began, most in Baghdad; at least 19 have died in Iraq so far this month, representing the highest daily average since last September.\nThe deaths announced yesterday brought to at least 4,031 the number of U.S. troops to die in Iraq since the war began in March 2003. Brief military statements said three of the soldiers died in roadside bomb blasts: two in northeastern Baghdad and one east of the city. Two others died of \"non-combat\" injuries, statements said, giving no other details.", "orig_sample_length": 754, "prompt_length": 201, "real_completion_length": 553, "no_bl_gen_time": 10.308495998382568, "w_bl_gen_time": 12.563291788101196, "no_bl_output": " be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be", "w_bl_output": " be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.05180148742905813, "no_bl_tok_per_sec": 19.304464980267117, "w_bl_sec_per_tok": 0.06313211953819696, "w_bl_tok_per_sec": 15.839797670581419, "baseline_loss": 6.278214454650879, "baseline_ppl": 532.83642578125, "no_bl_loss": 1.8767482042312622, "no_bl_ppl": 6.532228946685791, "w_bl_loss": 1.8767482042312622, "w_bl_ppl": 6.532228946685791}
{"idx": 55, "truncated_input": "Tulsa race riot survivor: \"Learn how to forgive, but never forget\"\nSAN FRANCISCO, California (CNN) -- A 100-inch, high definition screen projects an intense college basketball game. Massage therapists rub the nervous tensions of men and women away. Scissors skillfully cut men's hair. Two chandeliers adorn the main room, complimented by brick walls and a glass bar that doubles as a retail counter.\nSean Heywood, right, and Kumi Walker own MR., a barbershop and wine bar in San Francisco, California.\nThis is not your typical barbershop.\nAnd that has always been the vision of owners Kumi Walker and Sean Heywood.\n\"We are literally trying to create a new version of the country club golf experience. But we're replacing golf with haircuts, and we're putting it in urban environments,\" says Heywood.\nMR. (for mister) is their first business venture", "baseline_completion": ". It's an upscale barbershop, wine bar and lounge in the financial district of San Francisco where memberships cost $65 to $250 a month. In addition to the basic services, those who become members benefit from exclusive services like golf putting clinics and human resource workshops.\n\"We're trying to thrive, not just survive,\" Heywood said.\nMR. takes the cultural aspect of the black barbershop experience and modernizes it, making it a place where businesspeople of all races can network.\nThe two entrepreneurs are bridging a cultural divide, and also giving back to the community. They offer free lifetime memberships to MR. to those in good standing with a re-entry program called Back on Track.\nAmong other things, Back on Track offers first-time, low-level criminal offenders GED preparation, tutoring, money-management instruction and job training and placement. And that's where MR. steps in. The membership provides them with one free haircut, trim, and shoeshine monthly.\n\"We'll take care of their grooming so that they don't have to. And they're ready for all the different jobs that they pursue going forward,\" Walker says.\nGiving back is paramount for the entrepreneurs. And the story of one black business district in Tulsa, Oklahoma, inspires them. It was known as Black Wall Street, and it was destroyed in a race riot and fire 88 years ago.\n\"All of the businesses that we wanted to create, we wanted to encompass the culture of, if that community still existed today, what it would look like,\" says Walker, who says he read about the riot six years ago.\nImagine a credit union, a barbershop, a library, and men in freshly pressed suits with top hats sauntering on sidewalks. The melodic sounds of jazz flow into the streets from several nightclubs. A thriving community of black-owned businesses serve their clientele across a 42-block area.\nThat was the community that existed in the segregated neighborhood of Greenwood from 1830 to 1921.\nBut on the evening of May 31, 1921, white mobs entered Greenwood with torches and guns. Black residents gathered to protect a young man accused of assaulting a white woman. When the smoke from fires cleared on June 1, more than 1,000 homes, businesses and other institutions were burned or destroyed, according to the report of the Oklahoma Commission to Study the Tulsa Race Riot of 1921.\nSound off: What challenges do black entrepreneurs face?\niReport.com: How would you make black America better?\n\"People came and said, 'Run, they are shooting people,' \" says Wess Young, who was 4 then. \"We evacuated. They were destroying everything.\"\nThe death toll has been debated for years, because many victims were dumped in mass graves. An American Red Cross estimate puts the total at 300, much higher than the 36 reported by local officials.\nThe riot devastated the social underpinnings of the Greenwood community and leveled a black economic force. Greenwood was rebuilt, but it never recovered.\n\"It was a really tragic end to thriving businesses. I think we'd be a lot further ahead had that area been able to continue to thrive,\" says Walker.\nWess Young and his family rebuilt their lives in Tulsa. When asked what he thought America would be like if the Tulsa race riot had not happened, he answers without hesitation, \"We would have had a black president before now. ... He has done a good job, but we [blacks are] still in a box.\"\nHis advice to people is to let go of the past once they've learned from it.\n\"Hate will destroy your whole universe -- got to learn how to forgive, but never forget,\" Young says.\nWalker says these stories of black struggle and survival motivate him.\n\"I stand on the shoulders of my ancestors,\" he says. \"I just want to be as successful as possible so I can turn around and be mentors and sponsors to other people who come after me.\"", "orig_sample_length": 1027, "prompt_length": 201, "real_completion_length": 826, "no_bl_gen_time": 10.320699453353882, "w_bl_gen_time": 12.543448686599731, "no_bl_output": " capitalization of the same as well known as well known as well known as well as well as well as well as well as well as well as well as well as well as you can be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "w_bl_output": " of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.05186281132338634, "no_bl_tok_per_sec": 19.2816388946712, "w_bl_sec_per_tok": 0.06303240546030016, "w_bl_tok_per_sec": 15.86485542947956, "baseline_loss": 5.977559566497803, "baseline_ppl": 394.47650146484375, "no_bl_loss": 2.006542921066284, "no_bl_ppl": 7.437560558319092, "w_bl_loss": 1.6630147695541382, "w_bl_ppl": 5.275190353393555}
{"idx": 56, "truncated_input": "Two recently published reports shed damning light on the high cost of low wages in the fast food industry – an industry dominated by the restaurant giant McDonald’s, which raked-in over $5.4 billion in profits last year.\nThe reports – Super Sizing Public Costs: How Low Wages at Top Fast-Food Chains Leave Taxpayers Footing the Bill and Fast Food, Poverty Wages: The Public Cost of Low-Wage Jobs in the Fast-Food Industry – argue that low-wages in the fast-food industry cost taxpayers nearly $7 billion annually.\nMedicaid and CHIP (the Children’s Health Insurance Program) account for more than half of the $7 billion, at an average of $3.9 billion annually. Additionally, due to low earnings, fast food workers’ families also receive an annual average of $1.04 billion in food stamp benefits and $1.91 billion in Earned Income Tax Credit payments.\n", "baseline_completion": "The ten largest fast-food companies alone made more than $7.4 billion in profits in 2012 and paid their top executives more than $53 million in compensation.\nLow-wage fast-food jobs cost tax-payers the most in California ($717 million), New York ($708 million), Texas ($556 million), Illinois ($368 million), and Florida ($348 million).\nAccording to Super Sizing Public Costs, “McDonald’s represents the most costly fast-food company for tax-payers.” Low wages and lack of benefits at McDonald’s cost tax-payers “$1.2 billion every year in public assistance programs,” according to the report.\nYUM! Brands (Pizza Hut, Taco Bell, KFC), Subway, Burger King and Wendy’s round-out the top five fast-food companies with workers who rely on public assistance.\nThe median average wage for fast-food workers is $8.69; an estimated 87 percent of fast-food workers do not receive health benefits. Furthermore, 67 percent of front-line fast-food workers are adults 20 and older; 68 percent are the main earners in their families and more than one-quarter are raising children.\n“This business model puts tax-payers on the hook, while rewarding corporate CEO’s,” Jack Temple, a policy analyst for the National Employment Law Project and co-author of Super Sizing Public Costs, said during a conference call with the press on October 15.\nThe reports come on the heels of a nation-wide wave of fast-food worker strikes; most recently strikes took place in over 60 cities across the nation with thousands of fast-food workers walking off their jobs.\n“The CEO of McDonald’s makes more in a day than I make in a year,” Yates added.\nFast-food workers nationally are calling for $15 an-hour in pay and the right to form or join a union without retaliation.\nJacobs also addressed the wave of non-traditional worker organizing taking place in fast-food, retail and other low-wage service sector jobs.\nSuper Sizing Public Costs: How Low Wages at Top Fast-Food Chains Leave Taxpayers Footing the Bill was published by the National Employment Law Project and Fast Food, Poverty Wages: The Public Cost of Low-Wage Jobs in the Fast-Food Industry was published by the University of California Labor Center.", "orig_sample_length": 708, "prompt_length": 201, "real_completion_length": 507, "no_bl_gen_time": 10.315423727035522, "w_bl_gen_time": 12.56880784034729, "no_bl_output": "10% of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of", "w_bl_output": "1, which is a few days of a few days of a few thousand dollars per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent of a day, which is a few thousand dollars per cent per cent per cent per cent per cent per cent per cent of a few thousand dollars per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent per cent", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.0518363001358569, "no_bl_tok_per_sec": 19.29150030729656, "w_bl_sec_per_tok": 0.06315983839370498, "w_bl_tok_per_sec": 15.832846084350782, "baseline_loss": 5.995132923126221, "baseline_ppl": 401.47003173828125, "no_bl_loss": 0.8055562376976013, "no_bl_ppl": 2.237941026687622, "w_bl_loss": 1.963516354560852, "w_bl_ppl": 7.124334812164307}
{"idx": 57, "truncated_input": "When Cait and I found out how easy it is to make ravioli–and with such completely impressive and delicious results!–we just had to share this fabulous harvest recipe with you.\nThis dish is a poem to autumn, filled with sweet, tender butternut squash combined with a touch of honey, fresh thyme, rosemary, sage, and Parmesan, and topped with chopped hazelnuts (or you could substitute walnuts) and brown butter. This would work beautifully for any family feast or romantic, intimate dinner.\n1. Preheat oven to 350F. Lightly oil a baking sheet. Cut the squash in half through the stem and lay the halves cut side down on the oiled baking sheet. Bake 50-60 minutes, until easily pierced with a knife. Remove from oven and set aside to cool. Scoop out seeds and fibers and discard, then spoon the flesh into a mixing bowl. Mash squash with a potato-masher until smooth, then", "baseline_completion": " add breadcrumbs, 2 tablespoons Parmesan, honey, thyme, rosemary, chopped sage, and orange zest. Mix thoroughly and season with salt and pepper.\n2. Warm the olive oil and nut oil over medium heat in a small frying pan and add hazelnuts or walnuts. Cook, stirring often, about 3 minutes, or until nuts are golden. Transfer nuts to a plate and set aside.\n3. Melt butter in a medium saucepan until it turns brown and begins to smoke, 3-4 minutes. Remove immediately from heat, add nutmeg, and set aside.\n4. Place a pasta sheet on a lightly floured work surface. Spoon mounds of filling on the sheet about 1 1/2 inches apart (the number of mounds you make will depend on the size of the pasta sheets you use). Lightly mist the mounds with a spray mister filled with water, then place a second pasta sheet over the first, covering the filling mounds, and pressing firmly around the edges and between the mounds to seal. Using a fluted cutting wheel or knife, cut between the rows of ravioli. Repeat with remaining sheets of pasta and filling.\n5. Bring a large pot of salted water to a boil. Add ravioli and cook until tender, 2-3 minutes. To serve, reheat the browned butter. Drain ravioli and place in warmed serving bowl. Toss with butter, sprinkle with hazelnuts and 1/4 cup Parmesan. Garnish with sage leaves and serve immediately.\nInspired by Williams-Sonoma Seasonal Celebration: Autumn, by Joanne Weir (Time-Life Books, 1997).", "orig_sample_length": 549, "prompt_length": 201, "real_completion_length": 348, "no_bl_gen_time": 10.328133344650269, "w_bl_gen_time": 12.580875873565674, "no_bl_output": " you can’s in a few months ago, and a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of", "w_bl_output": " a few days of a few days of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few weeks worth of a few days of a few days of a few days of a few weeks worth of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of", "no_bl_num_tokens_generated": 197, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.052427072815483595, "no_bl_tok_per_sec": 19.074114694892216, "w_bl_sec_per_tok": 0.06322048177671193, "w_bl_tok_per_sec": 15.81765864315768, "baseline_loss": 5.971084117889404, "baseline_ppl": 391.9303283691406, "no_bl_loss": 1.838965654373169, "no_bl_ppl": 6.290029048919678, "w_bl_loss": 1.7749857902526855, "w_bl_ppl": 5.900197505950928}
{"idx": 60, "truncated_input": "LOS ANGELES – A lawsuit filed Wednesday against ABC (search) and \"American Idol\" judge Simon Cowell (search) alleges they conspired to steal the brand and concept of \"Million Dollar Idea,\" a series airing in syndication.\nThe suit, filed in federal court by Jean Golden and Todd Walker, the creators and hosts of \"Million Dollar Idea,\" (search) follows ABC&apos;s announcement in July of a new show of the same name that the network said was created by Cowell.\n\"From stem to stern, each and every detail of Simon Cowell and ABC&apos;s mock &apos;Million Dollar Idea&apos; is a patent rip-off of Todd and Jean&apos;s four-year labor of love,\" attorney Pierce O&apos;Donnell alleged in a statement Wednesday.\nThe lawsuit sees to stop ABC from using the name and idea and calls for unspecified damages. O&apos", "baseline_completion": ";Donnell predicted they would reach into \"the tens of millions of dollars.\"\nA call seeking comment from Cowell was not immediately returned Wednesday.\n\"We have not even been served with the complaint in this matter, and so have no comment,\" said ABC spokeswoman Annie Fort.\nThe suit also names FremantleMedia North America, producer of FOX&apos;s \"American Idol\" and proposed producer of ABC&apos;s \"The Million Dollar Idea.\" (Note the slightly different title.) FremantleMedia does not comment on pending litigation, spokesman Brian Reinert said.\n\"Million Dollar Idea\" first aired on KSTC-TV in the Minneapolis-St. Paul market in 2003. The series was recently syndicated to more than 125 stations nationwide and its creators registered for both copyright and trademark for the show&apos;s name and premise, according to their statement.\nThe show is taped before an audience and judges at the Mall of America. New product inventors and marketers from across the country compete for a prize package to help launch their product and place it for sale with a Mall of America retailer.\nThe syndicated series has received newspaper, magazine and TV coverage, including on NBC&apos;s \"Today\" show, the suit says.\n\"It is incredibly ironic that our show, the premise of which is to promote, protect and reward small-town American ingenuity, was itself the victim of corporate theft and greed,\" Golden said.\nHer partner, Walker, pitched a deal for the show to ABC in early 2004 and provided copies of their presentation to CAA, according to the suit. That&apos;s the same agency identified in a recent ABC press release as having \"packaged\" \"The Million Dollar Idea\" with Cowell.\nBesides the alleged theft of the title, every major concept connected to the show also was copied, the suit claims.\nIn the July 13 news release announcing \"The Million Dollar Idea,\" ABC described the series as \"a nationwide search for America&apos;s greatest entrepreneur with the best business idea or new product,\" with the prize to be $1 million \"worth of business support,\" including cash and other resources.\nThe idea was conceived by Cowell and British entrepreneur Peter Jones, according to the ABC release.", "orig_sample_length": 671, "prompt_length": 201, "real_completion_length": 470, "no_bl_gen_time": 10.301338911056519, "w_bl_gen_time": 12.566908836364746, "no_bl_output": " of the end up to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able", "w_bl_output": " of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.05176552216611316, "no_bl_tok_per_sec": 19.317877192295025, "w_bl_sec_per_tok": 0.06315029566012435, "w_bl_tok_per_sec": 15.835238608889687, "baseline_loss": 6.404233932495117, "baseline_ppl": 604.3986206054688, "no_bl_loss": 1.8901406526565552, "no_bl_ppl": 6.620299816131592, "w_bl_loss": 1.5452306270599365, "w_bl_ppl": 4.689053058624268}
{"idx": 61, "truncated_input": "Are stoners now a target advertising demographic for fast food companies?\nEver since Harold and Kumar went to White Castle, fast-food companies have become increasingly blatant about targeting to stoners in their advertisements.\nJuly 31, 2012, 1:48 a.m.\nBetween Taco Bell's \"Fourthmeal\" advertisements and Jack in the Box commercials featuring slow-talking stoners, it's hardly a secret anymore that fast-food companies are shamelessly targeting potheads with their ads. But have they crossed a line?\nOnce considered a taboo marketing approach, the fast-food industry today appears to have brazenly embraced the late-night munchies, according to The Fix. Although advertisements never blatantly refer to pot smoking, subliminal messaging has become more obvious.\nTake, for instance, this recent Jack in the Box advertisement. And Taco Bell has created a jingle to go with its latest string of advertisements, which sings of the \"late-night munch", "baseline_completion": "ies.\" Of course, drive-thru windows open well into the morning hours also cater to the average midnight snacker, but there's little denying who the real target is given the choice of terminology.\n\"If you're targeting that heavy fast-food user, you need to speak their language,\" said Denise Yohn, a brand consultant who's worked with restaurants for 25 years, to The Fix. \"One way to do that is to talk about partying and munchies. To the mainstream audience it may just sound like late nights and drinking, but to a certain audience they're talking about getting stoned.\"\nIt's not the same thing as flagrantly endorsing the use of marijuana, of course. But the fast-food industry no longer appears to think the pothead subculture is off limits either. Perhaps they're just embracing a market force, but the strategy also runs perilously close to catering directly to a drug-induced appetite that drives people to consume their product.\nOf course, this wouldn't be the first time that the fast-food industry was accused of catering to addiction. Not only has fast food been proven to be highly addictive, but the industry actually hires scientists to design its food for exactly that purpose.\nWhether marketing to stoners crosses an ethical line or not, it certainly seems to be working. Taco Bell has seen its sales spike by 6 percent since launching its \"late-night munchies\" advertisements. The marketing has been so successful that at least one new upstart fast-food enterprise has decided to sell its line of frozen burritos directly to potheads. Drive-thrus of nearly every major fast-food chain now typically stay open past midnight, undoubtedly due to a steady profit margin.\nSo long as it works, it's not likely to change. In fact, without any backlash, it may not be long before advertisers compete explicitly for the stoner demographic.\n\"A lot of companies are skipping the innuendo,\" said Yohn. \"They think it's more effective to be overt. It creates more buzz. I think that's why you see a lot of advertising that seems unapologetically targeted to pot smokers.\"\nEver since Harold and Kumar went to White Castle, fast food companies seem increasingly blatant about targeting to stoners in their advertisements.", "orig_sample_length": 673, "prompt_length": 201, "real_completion_length": 472, "no_bl_gen_time": 10.292032241821289, "w_bl_gen_time": 12.559863090515137, "no_bl_output": "ilds of the same as well known as well known as well known as well as well as well as well as well as well as well as well as well as well as you can be able to be able to be able to be able to be able to as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well", "w_bl_output": "angry, as well known as well known as well known as well as well as well as well as well as well as well as well as possible. as possible. as possible. as possible. as well as possible. as possible. as possible. as possible. as possible. as possible. as possible. as possible. as possible. as well as possible. as possible. as possible. as well as possible. as possible. as well as possible. as possible. as well as possible. as possible. as possible. as well as possible. as possible. as possible. as well as possible. as possible. as possible.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis is a.\n\n\n\n\nThis is one of course of course, as possible.\n\n\n\n\n\n\n\n\n\n\n", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 185, "no_bl_sec_per_tok": 0.05171875498402658, "no_bl_tok_per_sec": 19.335345568717802, "w_bl_sec_per_tok": 0.06789115184062236, "w_bl_tok_per_sec": 14.72945992060271, "baseline_loss": 6.0015387535095215, "baseline_ppl": 404.050048828125, "no_bl_loss": 1.234825611114502, "no_bl_ppl": 3.437778949737549, "w_bl_loss": 2.7682292461395264, "w_bl_ppl": 15.930399894714355}
{"idx": 65, "truncated_input": "As many British visitors to France have learnt to their dismay, if you ask a local, “Parlez-vous anglais?”, the answer is often “Non”.\nSuch a response, perhaps accompanied by a dismissive Gallic shrug, may prompt the appearance on the traveller’s face of what the author PG Wodehouse described as “the shifty hangdog look that announces that an Englishman is about to speak French”.\nBritons have never been renowned for their mastery of French — or indeed any other foreign language — but a new ranking shows that our historical rivals and closest neighbours have little to crow about when it comes to their command of English.\nThe English Proficiency Index, a survey of countries without English as a national language, puts France in 35th place – behind the Philippines, South Korea and Lebanon.\nThe index, compiled by Education First, a language training company, ranks the French as the worst English speakers", "baseline_completion": " in western Europe while Sweden comes out top.\nChristian Monlord, a Frenchman and conference interpreter, said the results did not surprise him. “French used to be the language of diplomacy, and it is still a big international language, so many French people still take the attitude that others should speak their language,” said Mr Monlord, 75.\nAnother reason why the French are lagging behind in learning English may be a feeling that the world’s lingua franca is creeping into daily life in France, threatening the very survival of the language of Voltaire.\nEnglish expressions are increasingly used by French speakers, even if their overall level of spoken English may not be good.\nParisians speak the best English in France, according to the survey, but it places the capital 25th among international cities behind Shanghai, Buenos Aires and Sofia, the capital of Bulgaria.\nMany French people also blame foreign language teaching in schools.\nTeachers say they are trying to place more emphasis on conversational English, but they are often limited by a lack of resources, especially in small towns and rural areas.\nDamien Gabriel, 29, said children and their parents were also to blame. “I think there are many kids in school who don’t understand how important it is to speak English,” he said.\nAccording to a Eurobarometer report in 2012, 39 per cent of France’s population speak English. Another survey published by the European Commission indicated that 38 per cent of Britons speak a foreign language.", "orig_sample_length": 516, "prompt_length": 201, "real_completion_length": 315, "no_bl_gen_time": 10.336257219314575, "w_bl_gen_time": 12.526932954788208, "no_bl_output": " of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the United States of the", "w_bl_output": " of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few", "no_bl_num_tokens_generated": 198, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.05220331928946755, "no_bl_tok_per_sec": 19.155870040657707, "w_bl_sec_per_tok": 0.06294941183310657, "w_bl_tok_per_sec": 15.885771937809855, "baseline_loss": 5.465627670288086, "baseline_ppl": 236.42420959472656, "no_bl_loss": 0.8165454268455505, "no_bl_ppl": 2.262669801712036, "w_bl_loss": 1.5295535326004028, "w_bl_ppl": 4.616115570068359}
{"idx": 67, "truncated_input": "For professors, publishing in elite journals is an unavoidable part of university life. The grueling process of subjecting work to the up-or-down judgment of credentialed scholarly peers has been a cornerstone of academic culture since at least the mid-20th century.\nNow some humanities scholars have begun to challenge the monopoly that peer review has on admission to career-making journals and, as a consequence, to the charmed circle of tenured academe. They argue that in an era of digital media there is a better way to assess the quality of work. Instead of relying on a few experts selected by leading publications, they advocate using the Internet to expose scholarly thinking to the swift collective judgment of a much broader interested audience.\nThat transformation was behind the recent decision by the prestigious 60-year-old Shakespeare Quarterly to embark on an uncharacteristic experiment in the forthcoming fall issue — one that will make it, Ms. Rowe says, the first traditional humanities journal to open its reviewing to the", "baseline_completion": " World Wide Web.\nMixing traditional and new methods, the journal posted online four essays not yet accepted for publication, and a core group of experts — what Ms. Rowe called “our crowd sourcing” — were invited to post their signed comments on the Web site MediaCommons, a scholarly digital network. Others could add their thoughts as well, after registering with their own names. In the end 41 people made more than 350 comments, many of which elicited responses from the authors. The revised essays were then reviewed by the quarterly’s editors, who made the final decision to include them in the printed journal, due out Sept. 17.\nThe Shakespeare Quarterly trial, along with a handful of other trailblazing digital experiments, goes to the very nature of the scholarly enterprise. Traditional peer review has shaped the way new research has been screened for quality and then how it is communicated; it has defined the border between the public and an exclusive group of specialized experts.\nToday a small vanguard of digitally adept scholars is rethinking how knowledge is understood and judged by inviting online readers to comment on books in progress, compiling journals from blog posts and sometimes successfully petitioning their universities to grant promotions and tenure on the basis of non-peer-reviewed projects.\nThe quarterly’s experiment has so far inspired at least one other journal — Postmedieval — to plan a similar trial for next year.\nJust a few years ago these sorts of developments would have been unthinkable, said Dan Cohen, director of the Center for History and New Media at George Mason University. “Serious scholars are asking whether the institutions of the academy — as they have existed for decades, even centuries — aren’t becoming obsolete,” he said.\nEach type of review has benefits and drawbacks.\nThe traditional method, in which independent experts evaluate a submission, often under a veil of anonymity, can take months, even years.\nClubby exclusiveness, sloppy editing and fraud have all marred peer review on occasion. Anonymity can help prevent personal bias, but it can also make reviewers less accountable; exclusiveness can help ensure quality control but can also narrow the range of feedback and participants. Open review more closely resembles Wikipedia behind the scenes, where anyone with an interest can post a comment. This open-door policy has made Wikipedia, on balance, a crucial reference resource.\nMs. Rowe said the goal is not necessarily to replace peer review but to use other, more open methods as well.\nIn some respects scientists and economists who have created online repositories for unpublished working papers, like repec.org, have more quickly adapted to digital life. Just this month, mathematicians used blogs and wikis to evaluate a supposed mathematical proof in the space of a week — the scholarly equivalent of warp speed.\nIn the humanities, in which the monograph has been king, there is more inertia. “We have never done it that way before,” should be academia’s motto, said Kathleen Fitzpatrick, a professor of media studies at Pomona College.\nMs. Fitzpatrick was a founder of the MediaCommons network in 2007. She posted chapters of her own book “Planned Obsolescence” on the site, and she used the comments readers provided to revise the manuscript for NYU Press. She also included the project in the package she presented to the committee that promoted her to full professor this year.\nMany professors, of course, are wary of turning peer review into an “American Idol”-like competition. They question whether people would be as frank in public, and they worry that comments would be short and episodic, rather than comprehensive and conceptual, and that know-nothings would predominate.\nAfter all, the development of peer review was an outgrowth of the professionalization of disciplines from mathematics to history — a way of keeping eager but uninformed amateurs out.\n“Knowledge is not democratic,” said Michèle Lamont, a Harvard sociologist who analyzes peer review in her 2009 book, “How Professors Think: Inside the Curious World of Academic Judgment.” Evaluating originality and intellectual significance, she said, can be done only by those who are expert in a field.\nThe most daunting obstacle to opening up the process is that peer-review publishing is the path to a job and tenure, and no would-be professor wants to be the academic canary in the coal mine.\nAlthough initially cautious, Mr. Galey said he is now “entirely won over by the open peer review model.” The comments were more extensive and more insightful, he said, than he otherwise would have received on his essay, which discusses Shakespeare in the context of information theory.\nAdvocates of more open reviewing, like Mr. Cohen at George Mason argue that other important scholarly values besides quality control — for example, generating discussion, improving works in progress and sharing information rapidly — are given short shrift under the current system.\n“There is an ethical imperative to share information,” said Mr. Cohen, who regularly posts his work online, where he said thousands read it. Engaging people in different disciplines and from outside academia has made his scholarship better, he said.", "orig_sample_length": 1281, "prompt_length": 201, "real_completion_length": 1080, "no_bl_gen_time": 10.336466789245605, "w_bl_gen_time": 12.535193920135498, "no_bl_output": " end up to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to end up to be able to be able to be able to be able to to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "w_bl_output": " world of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.05194204416706334, "no_bl_tok_per_sec": 19.252226515838665, "w_bl_sec_per_tok": 0.06299092422178643, "w_bl_tok_per_sec": 15.875302868696979, "baseline_loss": 6.074772834777832, "baseline_ppl": 434.750732421875, "no_bl_loss": 1.8368339538574219, "no_bl_ppl": 6.276634693145752, "w_bl_loss": 1.566941738128662, "w_bl_ppl": 4.791970729827881}
{"idx": 68, "truncated_input": "Adweek: So what’s a digital-media tyro like you doing at a fusty old-media company like CBS?\nJim Lanzone: I don’t really think of it that way at all. People think the Internet will supercede TV, but it’s really been more additive than anything else, largely because it’s so portable. It’s not taking anything away from linear television; if anything, it’s encouraged people to spend even more time watching video.\nAW: The fact that we can watch TV on a telephone: is this doing something insidious to the parts of our brain that process narrative?\nJL: Think about the very early days of TV—the first shows were structured just like radio broadcasts or Broadway shows. You start with the familiar and you expand from there. Creative people haven’t taken advantage of the new media platforms; we’re still in this brackish time", "baseline_completion": " between two eras.\nAW: You still watch TV?\nJL: I’m a binge watcher. I have DirecTV, so I have a ton of shows on the DVR: The Daily Show, [Real Time With] Bill Maher, SNL. I’ve been watching How I Met Your Mother for six years. There are definitely more shows out there that I want to watch that I don’t have time to watch, which I suppose is a great sign of where programming is headed.\nAW: Why did CBS issue a fatwa against Hulu?\nAW: Can you write code?\nJL: I never got into programming when I was a kid. I was too busy playing Pitfall and Kaboom! on Atari to write code. But then again, I don’t think Les Moonves knows how to make a television set either.\nAW: So there’s no disconnect between the old media centers—New York, L.A.—and Silicon Valley?\nJL: Well, you’re looking at it from a geographic standpoint and that really isn’t relevant any longer. I think Silicon Valley is the third leg of the media stool; I mean, there’s a reason why all the animated features are made in Silicon Valley now. Engineers are the new artists of this generation of media.\nAW: Are you from Silicon Valley?\nJL: I grew up in San Carlos, where Oracle now stands. In fact, they built Oracle on the old Marine World site. George Lucas used some of the elephants from Marine World in Star Wars, and after it came out—I must have seen it 25 times that summer—they started offering Bantha rides at Marine World.\nAW: Speaking of which, what the hell happened to George Lucas? Those three Star Wars prequels were just god-awful.\nJL: I know what happened to George Lucas: the ‘80s. If movies peaked in the ‘70s, then it’s fair to say that the 2000s is the Renaissance period for TV. The new Battlestar [Galactica] was at least a thousand times better than the old one. And I almost didn’t watch it at first because I was afraid it was going to ruin my childhood memories of the original.", "orig_sample_length": 688, "prompt_length": 201, "real_completion_length": 487, "no_bl_gen_time": 10.299823760986328, "w_bl_gen_time": 12.605920553207397, "no_bl_output": " to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "w_bl_output": " to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.051757908346664966, "no_bl_tok_per_sec": 19.320718938296032, "w_bl_sec_per_tok": 0.06334633443822812, "w_bl_tok_per_sec": 15.786233076755927, "baseline_loss": 5.587480545043945, "baseline_ppl": 267.0619201660156, "no_bl_loss": 1.8648093938827515, "no_bl_ppl": 6.454705238342285, "w_bl_loss": 1.8648093938827515, "w_bl_ppl": 6.454705238342285}
{"idx": 72, "truncated_input": "The latest report from Violence Policy Center.\nI find it ironic and sad that the very day an annual report on violence against women was released, a famed pro athlete was kicked off his team for slugging his wife in the face.\nBy now you’ve probably heard that Ray Rice, the Baltimore Ravens star running back, was caught on camera hitting his then-fiance and knocking her out with the single blow in an elevator . The March incident cost him a two-game suspension, but when TMZ released the video showing the act, the Ravens terminated his contract and the NFL suspended him indefinitely.\nToday I captured the seriousness of domestic violence. The report from the Violence Policy Center shows that South Carolina is ranked the second worst state in the nation for violence against women. The report notes that 50 women were killed in 2012. Spartanburg County had four in 2012. The county has seen two husband-on-wife homicides so far this year and DV cases are some of the most common", "baseline_completion": " ones among daily incident reports here. Local leaders tell me it is a significant combination of problems that all need to be dealt with in order to change the status quo surrounding violence against women. Much of it starts with a serious culture change, they tell me.\nI was baffled when a colleague of mine pointed out the Fox News morning show “Fox & Friends.” The anchors on the program somehow find a way to joke about Ray Rice knocking out his now-wife and dragging her limp body out of the elevator.\n“I think the message is take the stairs,” one anchor quips.\nWe got right to the point during an interview today with the victim services director at SAFE Homes, a domestic violence shelter and coalition in Spartanburg County.\nThe gist of the interview was to hold people accountable for their actions and for society to never turn a blind eye.\nMy full story on the violence against women ranking in South Carolina is at goupstate.com and in Tuesday’s Spartanburg Herald-Journal.", "orig_sample_length": 413, "prompt_length": 201, "real_completion_length": 212, "no_bl_gen_time": 10.308247804641724, "w_bl_gen_time": 12.595846891403198, "no_bl_output": " sense of the same as well known as well known as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well as well", "w_bl_output": " sense of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.05180024022433027, "no_bl_tok_per_sec": 19.304929777725352, "w_bl_sec_per_tok": 0.06329571302212662, "w_bl_tok_per_sec": 15.798858283663296, "baseline_loss": 6.021625995635986, "baseline_ppl": 412.24835205078125, "no_bl_loss": 0.8577661514282227, "no_bl_ppl": 2.3578877449035645, "w_bl_loss": 1.6289160251617432, "w_bl_ppl": 5.0983452796936035}
{"idx": 73, "truncated_input": "Meet Google's Robot Army. It's Growing.\nGoogle can't stop buying robotics companies. In the past two months, eight of the 12 companies the search giant has acquired have \"robotics\" in their name or descriptions. Here's your complete breakdown of the robot army presently at Google's command.\nAs stated in the midst of its buying spree, the company's largely letting its new robotics divisions continue to work on their preexisting projects, and why wouldn't they? The newly acquired companies are doing a damn good job. They're even winning competitions.\nRobot technology would help with self-driving cars, certainly, but the range of these acquisitions hints at even broader ambitions. Again, we don't know much. They're all a part of the Google X division, which is top secret by definition. We do know what the new companies in the Google family are up to, though, and that might offer us some clues.\nThese guys are rockstars. The", "baseline_completion": " Japanese team that got its start at Tokyo University just took the top prize at DARPA's Robotics Challenge Trial thanks to the cunning and agility of its 5-foot, 5-inch, 209-pound bipedal robot. After being purchased by Google in early December 2013, Schaft's blue machine proved to be the best at walking on uneven terrain, climbing ladders, clearing debris, and connecting hoses, ultimately scoring an impressive 27 out of 32 possible points.\nThe company was originally founded to build disaster response robots after the Fukushima nuclear disaster in 2011 but has since broadened its scope, thanks in part to funding from the U.S. government. Who knows how far they'll go floating on Google's coffers?\nIndustrial Perceptions, Inc., is an imaging company that spun off of the Menlo Park robotics company Willow Garage. Before being acquired by Google in December—the day after the Schaft acquisition, in fact—IPI was focusing on building advanced technology for 3D vision-guided robots to be used in manufacturing and logistics. This includes the ability to see and sort different objects, say, in a factory. You could imagine a company like Amazon being very interested in this kind of technology, but it's so far unclear exactly what Google wants to do with it.\nRedwood Robotics started as a joint venture between Meka Robotics, SRI International, and Willow Garage, IPI's parent. And like IPI, it's always had a very focused mission. Redwood wants to build the \"next generation arm\" for robots. Meka Robotics founder Aaron Edsinger once said that he wants to do for robotic arms what the Apple II did for computers. Specifically, Redwood wants to build robotic arms that can work alongside people even in the comfort of their own home. That also means being the common arm manufacturer of service robots, so in the future, everybody's personal robot could have Redwood arms. Well, make that Google arms.\nLike its cousin, Redwood Robotics, Meka is dedicated to building robots that can live and work with human beings. The company describes its flagship model, the M1 Mobile Manipulator, as having \"human-safe, human-soft, and human scale robot technologies that will enable the robots of tomorrow to work alongside people in the home and the workplace.\" The human-like faces on the robot can even emote, a feature that's as creepy as you let it be.\nEven before joining Google, Holomini was a pretty secretive outfit. All we really know from its now shuttered website is the company describes itself as \"Creators of high-tech wheels for omnidirectional motion.\" The image above is just a stock photo guesstimate of what a \"high-tech wheel for omnidirectional motion\" might look like.\nIf Redwood and IPI are the engineers in the family, Bot & Dolly are the artists. The company describes itself as \"a design and engineering studio that specializes in automation, robotics, and filmmaking\" with a mission \"to advance motion control and automation as a creative medium.\" In reality, this means that Bot and & Dolly use robots to help film commercials and movies like Gravity. This doesn't mean that Google wants to get into the movie business, but hey, if a robot's good enough to make a movie, what else can it do?\nBoston Dynamics is the real celebrity of the bunch. After acquiring six robotics companies in six days, Google took a couple of days off before announcing this major acquisition. The company is known for building all kinds of futuristic bots from the bipedal, humanoid robot Atlas (above) to the impossibly fast, four-legged Cheetah. Actually, Boston Dynamics brings a whole robot army to Google, one that the military is very eager to recruit.\nGoogle's latest purchase is less interested in building an actual robot than in designing an intelligent robot brain. The self-described \"cutting edge artificial intelligence company\" that uses \"the best techniques from machine learning and systems neuroscience to build powerful general-purpose learning algorithms: comes with a team of 75 researchers and software engineers whose talents could be put to use on anything from the hypothetical Googlebot to the company's flagship search engine and anything in between. Because after all, robots are just another step in Google becoming the company that is everywhere, and does everything.", "orig_sample_length": 1091, "prompt_length": 201, "real_completion_length": 890, "no_bl_gen_time": 10.306218147277832, "w_bl_gen_time": 12.554544448852539, "no_bl_output": " United States of the same as well known as well known as well as well as well as well as well as well as well as well as well as well as well as a result of course of course of course of course as well as well as well as well as you can be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "w_bl_output": " United States of the same as well known as well known as well as well as well as well as well as well as well as well as well as well as possible. as possible. as possible. as well as possible. as possible. as possible. as well as possible. as possible. as possible. as possible. as possible. as possible. as well as possible. as well as possible. as well as possible. as possible. as well as possible. as possible. as well as possible. as well as possible. as possible. as well as possible. as possible. as well as possible. as possible. as well as possible. as well as possible. as well as possible. as well as possible. as possible. as possible. as possible. as well as well as possible. as possible. as well as possible. as possible. as well as possible. as possible. as well as possible. as well as possible. as possible. as possible.\n", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 198, "no_bl_sec_per_tok": 0.051790040941094635, "no_bl_tok_per_sec": 19.308731598366332, "w_bl_sec_per_tok": 0.0634067901457199, "w_bl_tok_per_sec": 15.771181567491826, "baseline_loss": 6.3490309715271, "baseline_ppl": 571.938232421875, "no_bl_loss": 1.9639792442321777, "no_bl_ppl": 7.127633094787598, "w_bl_loss": 1.2676130533218384, "w_bl_ppl": 3.552363157272339}
{"idx": 74, "truncated_input": "Thorpe of the New York Trucking and Delivery Association says the decision to raise penalties won’t solve the parking crisis.\nFor more than a decade, Ken Thorpe has been a soldier in the fight against parking tickets, which has become part of the escalating war for access to the curb. It's a conflict that has intensified in recent years as ride-hail services have clogged roads, New Yorkers have had more of their purchases delivered, and the streetscape has been remade with bicycle lanes, pedestrian malls and restrictions on parking and unloading.\nThe city \"has whittled away at the commercial parking infrastructure,\" said Thorpe, the chief executive of the New York Trucking and Delivery Association, which he founded in 2004 to deal with parking issues for small and midsize businesses.\nAt the same time, trucks are making more deliveries than ever, and they must do that regardless of whether there's unloading space available. \"Trucking is not a '", "baseline_completion": "choice' situation,\" Thorpe said. \"It's a necessity.\"\nBut now the 600 members of his group, as well as large fleet operators such as UPS and FedEx, are facing higher fines—and possibly more paperwork and time in traffic court—as a little-known yet controversial city policy comes under fire. The stipulated-fine program was established in 2004 by the Department of Finance to let businesses pay slightly reduced fines—and no fines at all for some infractions—in exchange for not contesting their tickets.\nIt was mainly a way to reduce everyone's administrative costs while having delivery companies pay roughly what they would have otherwise. (The reductions were calculated with an eye on the percentage of tickets that were successfully challenged.) But the program was a sore point with advocacy groups such as Transportation Alternatives, which considered it a corporate giveaway that neutered traffic enforcement.\nLast month, in a bid at leveling the playing field for businesses not in the program—and furthering the city's congestion-reduction goals—the Finance Department announced that next month it would raise the program's fines, including those now set at zero.\nAs if that were not bad enough for Thorpe's membership, in the same week five City Council members introduced a bill to abolish the program. They denounced it as a free pass to large corporations and a contributor to reckless parking and congestion.\nThorpe says it's the council bill that's a giveaway—to parking-ticket brokers, who stand to gain business adjudicating tickets. He sees no way that the Finance Department's plan will change driver behavior or have any impact on congestion.\n\"The theory of the program was there are bad things, good things and some things in between, and it taught the driver you're going to pay a lot to do bad things and little or none to do the others,\" Thorpe said. \"Now they've put the bad and good closer together, removing the driver's incentive for doing the good, because it's going to cost just a little more to do the bad.\"\nIn fact, good and bad parking behavior will not be punished that similarly. The most serious violations that get discounts, such as obstructing traffic ($10 off the $115 total), will now get no break at all, while many of the zero-fine infractions will cost $25.\nBut Thorpe says those increases could cost some of his members hundreds of dollars a week—enough that he would consider taking them out of the program. The $35 fine for double parking outside Midtown is still better than the official $115, but he notes that double parking is legal for the first 30 minutes, and enforcement is not always scrupulous.\nIn 2011 he sued the city, which for some years had been slapping double-parked delivery trucks with the more expensive violation of blocking a travel lane, which carried a $40 fine. In 2016 the city settled and paid those covered by the lawsuit $14 million.\nEven so, the Finance Department, which worked with the Department of Transportation on the new fine schedule, says more needs to be done to ease congestion. The agency says the stipulated-fine program has been sending the wrong signal to the wider parking universe by not reflecting the fact that not all double-parking tickets are dismissed.\n\"We need the program to have incentives that are aligned with the city's goals to reduce congestion, and we need the program to be fair,\" said Finance Deputy Commissioner Jeffrey Shear. \"We agree that the conversation about congestion is a larger conversation, and there are many other factors, and this program is one small piece. But we don't want to send the wrong message by saying double parking outside of Midtown will cost businesses nothing.\"\nThe Transportation Department maintains that it is doing all it can.\nThe agency is \"committed to improving commercial accessibility throughout the five boroughs, especially in the context of our street-improvement projects,\" a spokeswoman said. As part of those projects, \"new curb regulations are installed that are complementary to the larger curb-management goals of the corridor, such as faster bus mobility, reduction of double parking, and better commercial access.\"\nBut the Transportation Department is aware that it's a long way from curing congestion when demand for deliveries from myriad e-commerce businesses, including Amazon and Fresh Direct, is bigger than ever.\n\"Consumer demands and the amount of available space we have at the curb, they're at odds right now,\" Transportation Commissioner Polly Trottenberg said at a Crain's breakfast forum last month. She added that parking enforcement can only do so much, and larger fixes, including congestion pricing and technology such as license-plate readers, might be part of the answer.\n\"Right now the demand for the curb exceeds the supply,\" she said.\nSome members of the City Council are not convinced that higher fines will make the program more effective. They say any solution will include abolishing stipulated fines.\n\"This program doesn't work,\" said Costa Constantinides, a City Council member from Queens, who introduced the bill to end the program as one of several parking and transportation proposals. \"Trucks are still parking in bike lanes. It's been around for years, and I really feel it's prohibiting us from having a real conversation around parking that we desperately need to have.\"\nAs part of that conversation, the councilman introduced a bill that would require the Department of Citywide Administrative Services, which oversees city agencies, to have buildings under its jurisdiction receive deliveries between 7 p.m. and 6 a.m.\n\"The city should lead by example,\" Constantinides said.\nThat's not so simple, it turns out. A Transportation Department off-hours delivery program proved unworkable for many businesses, some of which had to add employees to accept the shipments. The councilman said his program would be \"one part of the puzzle.\"\nAs it happens, parking-ticket broker Glen Bolofsky has contributed more than $4,000 to Constantinides' campaign treasury in the past five years. A spokesman for the councilman dismissed the idea that the bill was intended to help brokers.\n\"The majority of those that benefit from this [stipulated-fine] program are big-box delivery corporations who flout traffic laws at the expense of pedestrians, cyclists and drivers,\" the spokesman said.\nBolofsky agreed that ending the program would help brokers, but he insisted the biggest beneficiary would be the public. \"Congestion will be reduced,\" he said. \"More money will be raised.\"\nAssuming 70% of double-parking tickets are dismissed, he estimated the city has forfeited $147.5 million over the life of the program by not fining participants for double parking beyond Midtown.\nThe new schedule will collect about 30% of double-parking fines, but Bolofsky insists the program still benefits the biggest operators the most. He maintains that neither the city nor companies such as UPS will lose money adjudicating tickets, arguing that many companies still have in-house teams for the job, and automation can reduce the expense further. He noted that the city handled 12 million tickets a year in 1990, when they were handwritten, and had to deal with only 10 million last year. Enforcement agents now use handheld devices that reduce the errors and bad handwriting that led to dismissals.\nThe Finance Department disagrees with his conclusions, saying both the city and the 1,751 companies in the program—encompassing 48,880 vehicles—would spend more without the program.\n\"We would need more hearing officers,\" Shear said. \"The companies would have to retain brokers or hire staff to defend against these parking tickets. In terms of revenue, there would be no increase to the city.\"\nApart from whether the program is good for the city, a walk through Midtown with several UPS executives revealed how difficult following parking rules can be.\nAnother option would be to park at a metered spot a couple of blocks away and cart diamonds by hand truck to recipients, which UPS rules out for security reasons. \"It would put our driver and other people in the area at risk,\" said Axel Carrion, director of state public affairs.\nA few blocks away, on West 50th Street, where commercial parking was allowed at that hour, every space between Sixth and Seventh avenues was taken, mostly by delivery and commercial vehicles. There were two idling for-hire vehicles and three cars with \"parking authorization\" placards—the bane of parking-reform advocates—on their dashboard.\nEven when a UPS driver finds a legal spot, regulations can conflict with the company's efforts to operate efficiently. Using new dispatch-planning technology, the company has increased the number of packages a truck will carry to nearly 400 so that one truck does the work of two. But that truck needs to stay in one place much of the workday, doing pickups when it's done with deliveries. Parking rules—which aim to promote the flow of traffic and keep operators from hogging spots—require it to move after three hours.\nBut circling the block will delay deliveries and the truck could lose the spot, so the driver will stay put. This reduces congestion and pollution. But the ticket, which costs program participants nothing, will set them back $25 under the new schedule.\nOverall UPS expects its payments under the fine program to jump 32% next year, to $21.8 million, with a $3.4 million increase from double parking and more than $1 million from unloading in the wrong spot or at the wrong time. The company says it would like to try other solutions, such as paying for spots where a truck could sit all day. Long term, it would like to see new building construction include space for unloading.\nRight now the firm is weighing the benefits of staying in the program.\n\"My drivers can be trained to avoid the ticket, and we have drastically reduced the amount of tickets over the past couple of years,\" said Dan Byrnes, director of finance at UPS, adding that the city's ticket data aided his efforts. \"Now with these changes, [the city] is not really helping. Just raising prices is not going to change behavior.\"", "orig_sample_length": 2287, "prompt_length": 201, "real_completion_length": 2086, "no_bl_gen_time": 10.331745147705078, "w_bl_gen_time": 12.524057388305664, "no_bl_output": "s to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to have been able to be able to be able to be able to have been able to be able to be able to be able to be able to be able to have been able to have been able to be able to have been able to have been able to be able to be able to be to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "w_bl_output": "s of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.05191831732515115, "no_bl_tok_per_sec": 19.261024846727132, "w_bl_sec_per_tok": 0.06293496175027972, "w_bl_tok_per_sec": 15.889419365469868, "baseline_loss": 6.167635917663574, "baseline_ppl": 477.0569763183594, "no_bl_loss": 1.9414957761764526, "no_bl_ppl": 6.969167709350586, "w_bl_loss": 1.641066312789917, "w_bl_ppl": 5.160669326782227}
{"idx": 77, "truncated_input": "On April 4, 1975, Bill Gates and Paul Allen founded Microsoft. The small firm used to develop and sell BASIC interpreters. Little did they know that in the next 40 years, their company will become the biggest software firm in the world, and also bag the title for one of the most valuable companies.\nToday, there is a little bit of Microsoft in everybody’s life. Whether it is the desktop computer where Microsoft’s Windows has about 90 percent market share or the company’s Office which is unarguably the best productivity suite available. Maybe you are into gaming and own an Xbox One, or your company relies on Azure cloud services.\nIn the last 40 years, Microsoft -- which once used to sell program language interpreters -- has expanded into several categories, and now makes full-fledged operating systems for not just desktop computers, but smartphones, gaming consoles, servers, as well as Internet of Things devices. Surface tablets and Xbox consoles show the company�", "baseline_completion": "On April 4, 1975, Bill Gates and Paul Allen founded Microsoft. The small firm used to develop and sell BASIC interpreters. Little did they know that in the next 40 years, their company will become the biggest software firm in the world, and also bag the title for one of the most valuable companies.\nToday, there is a little bit of Microsoft in everybody’s life. Whether it is the desktop computer where Microsoft’s Windows has about 90 percent market share or the company’s Office which is unarguably the best productivity suite available. Maybe you are into gaming and own an Xbox One, or your company relies on Azure cloud services.\nIn the last 40 years, Microsoft -- which once used to sell program language interpreters -- has expanded into several categories, and now makes full-fledged operating systems for not just desktop computers, but smartphones, gaming consoles, servers, as well as Internet of Things devices. Surface tablets and Xbox consoles show the company’s side interest in developing its own hardware modules.\n\"Early on, Paul Allen and I set the goal of a computer on every desk and in every home. It was a bold idea and a lot of people thought we were out of our minds to imagine it was possible. It is amazing to think about how far computing has come since then, and we can all be proud of the role Microsoft played in that revolution\", Gates wrote in an email sent to all Microsoft employees yesterday.\n\"In the coming years, Microsoft has the opportunity to reach even more people and organizations around the world. Technology is still out of reach for many people, because it is complex or expensive, or they simply do not have access. So I hope you will think about what you can do to make the power of technology accessible to everyone, to connect people to each other, and make personal computing available everywhere even as the very notion of what a PC delivers makes its way into all devices\", Gates noted.\n\"Under Satya's leadership, Microsoft is better positioned than ever to lead these advances. We have the resources to drive and solve tough problems. We are engaged in every facet of modern computing and have the deepest commitment to research in the industry. In my role as technical advisor to Satya, I get to join product reviews and am impressed by the vision and talent I see. The result is evident in products like Cortana, Skype Translator, and HoloLens -- and those are just a few of the many innovations that are on the way\".\nAnd this attitude was the reason Windows Phone 7 -- arguably Microsoft's first real take on a mobile operating system-- wasn’t released until 2010. By this time, iPhone had showed its dominance in the world, and Google was upping the ante with Android. Windows Phone is still struggling to gain any substantial market share. The mobile platform still has a wide \"app-gap\" problem, though the company seems to have found a couple of ways to fix it.\nBut one of the most exciting things that happened in the company was its decision to open up. Under Nadella, Microsoft finally accepted that it doesn’t have a significant user base in smartphones. The company realized that if it didn't open up to rival platforms, it would miss out on a lot of users. And that’s one of the first things Nadella did after taking the charge of the company. Microsoft launched Office on iOS. Until then Office was only available on Windows, Windows RT, and Windows Phone, and a half-baked mobile version on Android.\nThe move received an overwhelming response from users, resulting in Office apps -- Word, Excel and PowerPoint -- top the app chart in within 24 hours of their release on the platform. Late last year, the company made premium access to the Office suite free on iOS and Android. Office for iOS was in the works at Microsoft for a long time, but Ballmer used to prioritize its products on Windows devices first. Nadella evidently changed that.\n\"We have accomplished a lot together during our first 40 years and empowered countless businesses and people to realize their full potential. But what matters most now is what we do next\", Gates writes in his email. Microsoft does have a lot of things to look forward to in the coming months and years. Later this year, Microsoft will release Windows 10 for desktop computers, as well as smartphones, IoT devices and Xbox One. In the coming months, Microsoft will also release the next iteration of its productivity suite, Office 2016. For the first time, the company is simultaneously releasing Office on OS X and Windows.\nAdditionally, Microsoft has showcased a number of products that could change the way we compute and interact with technology. Its augmented reality headset HoloLens is just one example. It will be interesting to see what the company does next and how things work out for it in the coming years.", "orig_sample_length": 992, "prompt_length": 201, "real_completion_length": 791, "no_bl_gen_time": 10.323701858520508, "w_bl_gen_time": 12.541971683502197, "no_bl_output": "On April 4, 1975, Bill Gates and Paul Allen founded Microsoft. The small firm used to develop and sell BASIC interpreters. Little did they know that in the next 40 years, their company will become the biggest software firm in the world, and also bag the title for one of the most valuable companies.\nToday, there is a little bit of Microsoft in everybody’s life. Whether it is the desktop computer where Microsoft’s Windows has about 90 percent market share or the company’s Office which is unarguably the best productivity suite available. Maybe you are into gaming and own an Xbox One, or your company relies on Azure cloud services.\nIn the last 40 years, Microsoft -- which once used to sell program language interpreters -- has expanded into several categories, and now makes full-fledged operating systems for not just desktop computers, but smartphones, gaming consoles, servers, as well as Internet of Things devices. Surface tablets and Xbox consoles show the company’s of the same as well known as well as well as well as well as well as well as well as well as well as you can be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able", "w_bl_output": "On April 4, 1975, Bill Gates and Paul Allen founded Microsoft. The small firm used to develop and sell BASIC interpreters. Little did they know that in the next 40 years, their company will become the biggest software firm in the world, and also bag the title for one of the most valuable companies.\nToday, there is a little bit of Microsoft in everybody’s life. Whether it is the desktop computer where Microsoft’s Windows has about 90 percent market share or the company’s Office which is unarguably the best productivity suite available. Maybe you are into gaming and own an Xbox One, or your company relies on Azure cloud services.\nIn the last 40 years, Microsoft -- which once used to sell program language interpreters -- has expanded into several categories, and now makes full-fledged operating systems for not just desktop computers, but smartphones, gaming consoles, servers, as well as Internet of Things devices. Surface tablets and Xbox consoles show the company’s as well as well as well as well as well as well as well as well as well as well as well as well as possible. so far as possible. as possible. as possible. as well as possible. as possible. as possible. as possible. as possible. as possible. as well as possible. as possible. as well as possible. as possible. as well as possible. as well as possible. as possible. as well as possible. as well as possible. as possible. as well as possible. as possible. as well as possible. as well as possible. as possible. as well as possible. as possible. as well as possible. as well as possible. as well as possible. as possible. as well as possible. as well as well as possible. as well as possible. as possible. as possible. as well as possible. as possible. as well as possible. as possible. as possible. as well as possible.\n", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 197, "no_bl_sec_per_tok": 0.05187789878653522, "no_bl_tok_per_sec": 19.27603128482042, "w_bl_sec_per_tok": 0.0636648308807218, "w_bl_tok_per_sec": 15.707259191083589, "baseline_loss": 5.744019508361816, "baseline_ppl": 312.3172607421875, "no_bl_loss": 4.036697864532471, "no_bl_ppl": 56.63900375366211, "w_bl_loss": 3.5941555500030518, "w_bl_ppl": 36.38496017456055}
{"idx": 78, "truncated_input": "The democratization of data is a real phenomenon, but building a sustainable data democracy means truly giving power to the people. The alternative is just a shift of power from traditional data analysts within IT departments to a new generation of data scientists and app developers. And this seems a lot more like a dictatorship than a democracy — a benevolent dictatorship, but a dictatorship nonetheless.\nThese individuals and companies aren’t entirely bad, of course, and they’re actually necessary. Apps that help predict what we want to read, where we’ll want to go next or what songs we’ll like are certainly cool and even beneficial in their ability to automate and optimize certain aspects of our lives and jobs. In the corporate world, there will always be data experts who are smarter and trained in advanced techniques and who should be called upon to answer the toughest questions or tackle the thorniest problems.\nLast week, for example, Salesforce.com introduced a new feature of its Chatter intra", "baseline_completion": "-company social network that categorizes a variety of data sources so employees can easily find the people, documents and other information relevant to topics they’re interested in. As with similarly devised services — LinkedIn’s People You May Know, the gravitational search movement, or any type of service using an interest graph — the new feature’s beauty and utility lie in its abstraction of the underlying semantic algorithms and data processing.\nThe problem, however, comes when we’re forced to rely on these people, features and applications to decide how data can affect our lives or jobs, or what questions we can answer using the troves of data now available to us. In a true data democracy, citizens must be empowered to make use of their own data as they see fit and they must only have to rely apps and experts by choice or when the task really requires an expert hand. At any rate, citizens must be informed enough to have a meaningful voice in bigger decisions about data.\nThe good news is that there’s a whole new breed of startups trying to empower the data citizenry, whatever their role. Companies such as 0xdata, Precog and BigML are trying to make data science more accessible to everyday business users. There are next-generation business intelligence startups such as SiSense, Platfora and ClearStory rethinking how business analytics are done in an area of HTML5 and big data. And then there are companies such as Statwing, Infogram and Datahero (which will be in beta mode soon, by the way) trying to bring data analysis to the unwashed non-data-savvy masses.\nCombined with a growing number of publicly available data sets and data marketplaces, and more ways of collecting every possible kind of data — personal fitness, web analytics, energy consumption, you name it — these self-service tools can provide an invaluable service. In January, I highlighted how a number of them can work by using my own dietary and activity data, as well as publicly available gun-ownership data and even web-page text. But as I explained then, they’re still not always easy for laypeople to use, much less perfect.\nStatwing spells out statistics for laypeople.\nCan Tableau be data’s George Washington?\nThis is why I’m so excited about Tableau’s forthcoming IPO. There are few companies that helped spur the democratization of data over the past few years more than Tableau. It has become the face of the next-generation business intelligence software thanks to its ease of use and focus on appealing visualization, and its free public software has found avid users even among relative data novices like myself. Tableau’s success and vision no doubt inspired a number of the companies I’ve already referenced.\nAssuming it begins its publicly traded life flush with capital, Tableau will not just be financially sound — it will also be in a position to help the burgeoning data democracy evolve into something that can last. More money means being able to develop more features that Tableau can use to bolster sales (and further empower business users with data analysis), which should mean the company can afford to also continually improve its free service and perhaps put premium versions in the hands of more types of more non-corporate professionals for free.\nTableau is already easy (I made this) — but not easy enough.\nThe bottom-up approach has already proven very effective in the worlds of cloud computing, software as a service and open-source software, and I have to assume it’s a win-win situation in analytics, too. Today’s free users will be tomorrow’s paying users once they get skilled enough to want to move onto bigger data sets and better features. But the base products have to be easy enough and useful enough to get started with, or companies will only have a lot of registrations and downloads but very few avid users.\nAnd if Tableau steps ups its game around data democratization, I have to assume it will up the ante for the company’s fellow large analytics vendors and even startups. A race to empower the lower classes on the data ladder would certainly be in stark contrast to the historical strategy of building ever-bigger, ever-more-advanced products targeting only the already-powerful data elite. That’s the kind of revolution I think we all can get behind.\nFeature image courtesy of Shutterstock user Tiago Jorge da Silva Estima.\nGreat article Derrick – appreciating your work on the topic here on GigaOm.\nWe’re seeing wider availability of reasonably priced BI and visualization software tools to help us understand that harnessing all this data is possible – and I think even consumers are beginning to understand the value of all the data, and the ability to make meaning from it. One part of the puzzle that’s missing from what I can see is the education – knowledge transfer of how individuals can use the tools, what good data science methods are, and how data citizens can actively contribute to the larger data analysis community. I see movements like the Open Data/Open Gov folks, and events like the NYC Big Apps hackathon as part of the solution – but as individuals, where do we go to take part? What is the role of an informed, curious citizen in this? More venues exist for learning some of the ‘how’ to make sense of big data as an individual taking a course online, but I’m not seeing a vision from anyone talking about how to connect all of the dots. To make sense of data, we need the tools, the practitioners, the analysis of the problems, but we also need a vision of how all of these will work. If anyone has ideas of who’s got that vision, I’d love to hear it.\nI feel one of the biggest impediments to the democratization of data is access. Most people know what they would like to answer, and how the data needs to be shaped to achieve that, but getting the data to do the actual analysis with can be one of the most difficult aspects.\nThis is a bit of a plug, but we’re working on enabling data access that is easily attainable by everyone. Our platform http://www.quandl.com is a “search engine for data” that is able to fetch time series data from a disparate sets of sources, and provide it in a simple searchable form that allows users to extract, validate, format, merge, graph, and share it however they want.\nBy providing the underlying data for analysis tools like Tableau, Statwing, and many others, we feel we can help to create the tool stack that empowers people to create a sustainable DIY data culture.\nIn every company I’ve worked at, I’ve seen this major divide between IT analysts and Business users. Part of it was cultural, but a major reason was as you point out: “a historical strategy of building ever-bigger, ever-more-advanced products targeting only the already-powerful data elite”. The business user typically was left to use Excel to prepare and analyze data.\nIt took 15+ years, but thanks to new players like Tableau, Spotfire and Qlikview which were sold primarily to the business user and focused on ease of use, the data democratization process has resulted in a power shift to the business user. Some IT departments have now come around and are trying to accommodate these “shadow IT” projects by providing IT support and giving Tableau users limited access to enterprise data stores.\nAs for upping the ante for the traditional players, it has happened already. Over the last two years, the larger vendors have responded with products like Visual Insight (MicroStrategy), Visual Intelligence (SAP), PowerPivot (MicroSoft), JMP (SAS) etc. taking aim at this segment of the market. The Big Data market is still new, but the trend to build user-friendly (or at the very least, SQL-aware) tools on top of Hadoop is also hitting its stride.\nOne good thing coming out of this data democratization is the realization that it has to be supported by a Data Governance effort. Otherwise we’ll see the unfortunate return of a major problem with data democracy: data chaos. Previously it would have meant comparing and reconciling two Excel spreadsheets, now we may end up reconciling the findings from two Tableau workbooks.\nThanks for the comment, and for making a really good point about data governance. Obviously, that’s not too big a concern for personal data use, but competing findings from lots of disparate data sets would be problematic.", "orig_sample_length": 2002, "prompt_length": 201, "real_completion_length": 1801, "no_bl_gen_time": 10.305508852005005, "w_bl_gen_time": 12.5873703956604, "no_bl_output": "-", "w_bl_output": "planning a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a", "no_bl_num_tokens_generated": 1, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 10.305508852005005, "no_bl_tok_per_sec": 0.09703548018450767, "w_bl_sec_per_tok": 0.06325311756613267, "w_bl_tok_per_sec": 15.809497436303843, "baseline_loss": 5.7914228439331055, "baseline_ppl": 327.4786376953125, "no_bl_loss": 0.30223795771598816, "no_bl_ppl": 1.3528831005096436, "w_bl_loss": 1.7029982805252075, "w_bl_ppl": 5.490384578704834}
{"idx": 80, "truncated_input": "The Council of PR Firms yesterday urged PR firms to \"pledge\" to Wikipedia that they will only submit materials to the hidden \"Talk\" pages where posts can languish for long periods and which are supervised by anonymous \"editors.\"\nJimmy Wales, co-founder of Wikipedia, has decreed an end to arguing over whether Gregory Kohs should have been allowed to speak at WP’s meeting May 30-June 1 at New York Law School.\nIt has been a momentous June 2014 on Wikipedia for those who follow the endless battle over encyclopedia content that is generated by public relations professionals.\nThe banning of Gregory Kohs from the Wikipedia conference May 30-June 1 has sparked an \"edit war\" of 10,000+ words on WP. Defenders of Kohs say he was \"condemned without a trial\" and start petition.\nNew York magazine, a \"reliable source\" to Wikipedia, has upset WP editors by linking to the odwyerpr.", "baseline_completion": "com coverage of WP critic Gregory Kohs being banned from the May 30-June 1 conference.\nThe tense relationship between the PR and Wiki communities ranked front and center at the first national WikiConference USA held May 30-June 1 at New York Law School in Manhattan’s Tribeca neighborhood.\nWikipedia, whose 21 billion hits a month makes it the fifth most popular website, drew 300 to a conference in New York this weekend. PR people are grappling with WP’s huge, autocratic and anonymous panel of editors.\nQorvis partner Matt Lauer has unleashed a barrage of criticism of Wikipedia over its policies blocking PR firms from editing content about clients and firms themselves, sparking a sparring match with Wikipedia founder Jimmy Wales.\nPR firm rankings by '18 net fees with separate charts for 12 public relations specialties such as healthcare PR, tech PR and travel PR. Look up top PR firms in key cities like New York, Chicago and Los Angeles.\nJan., PR Buyer's Guide/Crisis Comms.\nEach month a different area of PR is examined and firms with strengths in the focus area are profiled.", "orig_sample_length": 433, "prompt_length": 201, "real_completion_length": 232, "no_bl_gen_time": 10.338930606842041, "w_bl_gen_time": 12.599412679672241, "no_bl_output": " to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "w_bl_output": " so that they can be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.051954425160010254, "no_bl_tok_per_sec": 19.24763861634847, "w_bl_sec_per_tok": 0.06331363155614192, "w_bl_tok_per_sec": 15.7943870130601, "baseline_loss": 6.71904993057251, "baseline_ppl": 828.0304565429688, "no_bl_loss": 1.8654515743255615, "no_bl_ppl": 6.4588518142700195, "w_bl_loss": 1.931445837020874, "w_bl_ppl": 6.899478435516357}
{"idx": 81, "truncated_input": "Two Democratic state representatives from South Florida said Thursday that they've gathered with 33 colleagues to file paperwork with the Secretary of State to poll lawmakers for their support for a special session.\nAt the end of session, superintendents and the statewide teachers' union called for the Legislature to redo their education funding in the budget they were about to pass. When a special session seemed imminent on gambling issues, again, they made the same call, without success.\nNow, Democrats have organized a last-ditch effort to use an obscure state law to poll lawmakers on their willingness to come back for a special session to address education funding.\nState Reps. Shevrin Jones of West Park and Nicholas Duran of Miami said Thursday that they and 33 others have filed petitions with the Florida Secretary of State for the poll. This method of calling a special session circumvents the Republican Legislative leadership, who typically are the ones who must call any special sessions and declare its purpose.\nBoth Jones and Dur", "baseline_completion": "an hail from the two counties, Broward and Miami-Dade, hit hardest by a change in the way the state calculates school funding this year, designed to direct more dollars to smaller districts. They, like the rest of the House members who aren't termed out, are up for re-election.\n\"In the aftermath of Parkland and the waning days of session, the Legislature took action for the safety of our schools,\" Duran said. \"In our rush to do something we didn't account for the conesequences of that bill 7026 and now the school districts are facing those consequences.\"\nSince the passage of this year's budget as well as SB 7026, the Marjory Stoneman Douglas High School Public Safety Act, school districts have been scrambling to comply with the new safety requirements as well as their normal operations. Several are considering raising local property taxes.\nDemocrats tried the same tactic after the Pulse shooting in the summer of 2016, in an effort to force a special session vote on guns. They failed to garner enough support to call the session.\nThis year's final vote on the budget was taken on March 11, the Sunday after the legislative session was supposed to end but it went into overtime after the Feb. 14 Parkland shooting changed the entire direction of the session and caused lawmakers to reconcile with issues like school safety and gun rights not previously taking center stage.\nJones was not present for the vote on the budget. He said it was because after the Legislature's official end date he needed to go back to his full-time job as the executive director of the Florida Reading Corps, a branch of AmeriCorps. Duran voted yes, along with many other Democrats who argued against the budget but who ultimately voted for it.\n\"When our members were presented with the budget, they were presented with something they did not like,\" Jones said. \"But (some are) going to vote for it because there are some good things in there.\"\nDespite the fact that Republicans have said repeatedly that they are proud of the investment they made this year in education, Jones said this poll at the very least will require every lawmaker to go on the record in an election year with their position on the current school funding levels.\nIt's unlikely the Democrats will succeed, but now that the Secretary of State has received Jones and Duran's petition, that office will send out the poll today. Lawmakers will have until noon on May 24 to respond, according to Sarah Revell from the Secretary of State's office.", "orig_sample_length": 717, "prompt_length": 201, "real_completion_length": 516, "no_bl_gen_time": 10.304937601089478, "w_bl_gen_time": 12.610579490661621, "no_bl_output": "able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "w_bl_output": "able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.05178360603562551, "no_bl_tok_per_sec": 19.311131003739504, "w_bl_sec_per_tok": 0.06336974618422925, "w_bl_tok_per_sec": 15.780400904444031, "baseline_loss": 5.7302093505859375, "baseline_ppl": 308.03375244140625, "no_bl_loss": 1.8360264301300049, "no_bl_ppl": 6.271568298339844, "w_bl_loss": 1.8360264301300049, "w_bl_ppl": 6.271568298339844}
{"idx": 82, "truncated_input": "He and a neighbor managed to lure the horse toward them with a handful of grass, Sickinger said, and they even petted the horse for a bit. Sickinger had a strap he planned to use to bridle the horse, but he said better judgment took over and he decided the horse was too wild to control even if he could wrangle it.\nSickinger told a St. Clair County sheriff’s deputy the horse might belong to a neighbor. There are several horse farms in the area, but none came forward as the owner, Sickinger said.\nMoments after Sickinger started petting the horse, a truck drove by and the horse followed after it. No one would see the horse until more than a week later.\nOn Wednesday, area resident Aranza Lee spotted the horse in a soybean field near Imbs Station and Wagner roads, less than a mile from Sickinger’s home. She captured a video of the horse running freely through the", "baseline_completion": " field and shared it to the Millstadt News Facebook page. By Thursday afternoon, the post had more than 400 shares, but no one had come forward as the owner.\n“I mean, how weird is that?” said Sara Yoch of Smithton, a self-described horse-lover.\nLt. Alan Haake of the St. Clair County Sheriff’s Department said the department has received several reports over the past three weeks about the missing horse, but he said no one has come forward as the owner, nor has anyone been able to catch it.\nYoch was out at the intersection of Otten and Wagner roads Thursday afternoon with a bucket of feed and a lead, looking for the horse. She said she was out in the same area Wednesday for about four hours, but didn’t have any luck.\nShe warned area residents to avoid approaching the horse if they aren’t familiar with how horses behave, and to slow down when driving through the area. Yoch said a horse standing in a road on a dark night can cause serious damage to a vehicle and hurt the driver, as well as the horse, of course.\nIt’s possible the horse was dumped, according to Stephanie Goepfert, a member of the Lincoln Trail Riders in O’Fallon. It can easily cost more than $500 a month to care for a horse, Goepfert said, and it’s possible the owner could not afford to keep it.\nOn its own, the horse could get sick or injured, Goepfert added.\n“They can survive for a period of time in the wilderness, but if they’re a domesticated animal, they’re relying on a certain diet. It can be bad for them,” Goepfert said.\nThey can survive for a period of time in the wilderness, but if they’re a domesticated animal, they’re relying on a certain diet. It can be bad for them.\nThe most recent sign of the horse was a bedded-down area next to a creek near where the horse was spotted on Tuesday, Lee said.\nThere was no sign of the horse as of Thursday afternoon, though several groups were planning to head out and search for it.\nAnyone who spots the horse can call the St. Clair County Sheriff’s Department at 618-207-4374.", "orig_sample_length": 705, "prompt_length": 201, "real_completion_length": 504, "no_bl_gen_time": 10.331192255020142, "w_bl_gen_time": 12.548925876617432, "no_bl_output": " end of a few months ago, a few months ago, a few months ago, a few weeks ago, a few weeks ago, a few weeks ago. of a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a few weeks ago, a", "w_bl_output": " end of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.05191553896995046, "no_bl_tok_per_sec": 19.2620556357667, "w_bl_sec_per_tok": 0.0630599290282283, "w_bl_tok_per_sec": 15.857930946169596, "baseline_loss": 5.543066501617432, "baseline_ppl": 255.46017456054688, "no_bl_loss": 1.4604562520980835, "no_bl_ppl": 4.307924747467041, "w_bl_loss": 1.535536289215088, "w_bl_ppl": 4.643815517425537}
{"idx": 84, "truncated_input": "Wolf, 33, joined the Africa Mercy crew in March, taking a short leave from her job as a registered nurse with the UC Davis Medical Center’s burn unit. She sat down recently to talk about language barriers, cabin fever and readjusting to life in east Sacramento.\nQ: Between orphanage work in Zimbabwe and Guatemala and clinic work in Bolivia, you’re no stranger to long flights. How did that come about?\nA: I’ve always enjoyed traveling, and then once I became a nurse, to be able to use that career overseas was really neat to me. What intrigued me about Mercy Ships is it’s a fully run hospital – you have a lot of equipment, you have a lot of medications. It’s a lot of what I get to do here, over there.\nI am a Christian, and I think a lot of it has to do with seeing how God’s heart breaks when people are broken and", "baseline_completion": " poor. So much that you see is diseases of poverty.\nQ: In August, you were scheduled to join a Mercy Ships crew in Benin in West Africa, but the service was canceled due to a possible Ebola case. Months later, your own hospital became a designated Ebola treatment center, and you took part in the preparedness efforts. Would you have considered going overseas to provide care during the outbreak if given the chance?\nA: Had I been signed up with an Ebola team, I wouldn’t have been opposed. I enjoy the risk. I think that’s part of why I became a nurse, because there’s always those risks out there. When that came up, I decided to not be scared and to take more education and learn more about Ebola. For me, it was just a decision of, I’m a nurse, and I have risks even at UC Davis in Sacramento, and that’s why we learn to protect ourselves.\nQ: You said you had a much heavier patient load and more limited resources on the ship than you do in Sacramento. What did you learn on this trip that you’ll bring back to UCD?\nA: In the ward, there were 15 patients at a time with five nurses and five translators. There were people on the guitar and singing, and kids running around. It was a very different environment for me. I had to calculate my antibiotics and draw them up and mix them. It was just a stretch for me as a nurse, to need to focus on something, but also learn an art of nursing where I am appreciating and valuing the relationships of the Malagasy people. ... Just challenging my mind to see that I can function differently, and to bring that back to the burn unit is huge.\nQ: Working in the oral and facial ward, you said you saw a lot of patients with physical obstructions that had long been neglected, such as large dental tumors or cleft palates. What is life like for them after surgery?\nA: When you have a pimple and it feels like the end of the world, imagine missing a nose or having a tumor that’s out to there (gestures to a point several inches from her face). A lot of our patients lose their families, or their spouses will leave them. They are outcasts from society, so this gives them confidence. It brings them a huge healing, not just the physical aspect but their soul as well. ... When they have that healing, they finally feel like they can enter society again.\nQ: Even on top of the jet lag, you must have a lot going on right now. How do you readjust to your old life?\nA: I’ve done the reverse culture shock thing before, of coming to the U.S. and feeling like this is crazy. For me, it’s always reminding myself that these are two beautiful cultures that are different. There are good things about both of them. For me, knowing that God is present in both and working in both helps. But I never want to forget what I see.", "orig_sample_length": 845, "prompt_length": 201, "real_completion_length": 644, "no_bl_gen_time": 10.326117277145386, "w_bl_gen_time": 12.535504341125488, "no_bl_output": " you can be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able", "w_bl_output": " you can be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.051890036568569775, "no_bl_tok_per_sec": 19.271522360146268, "w_bl_sec_per_tok": 0.06299248412625874, "w_bl_tok_per_sec": 15.874909743131482, "baseline_loss": 5.247813701629639, "baseline_ppl": 190.15008544921875, "no_bl_loss": 1.6339088678359985, "no_bl_ppl": 5.12386417388916, "w_bl_loss": 1.6339088678359985, "w_bl_ppl": 5.12386417388916}
{"idx": 87, "truncated_input": "FILE - Guinea security forces, center, face people rioting and burning rubbish and other goods in the streets of Conakry, April 13, 2015.\nGuinean security forces clashed with anti-government protesters in the opposition stronghold of Labe on Thursday, beating one man to death, the government said.\n\"His friends got away but he was captured and beaten in the heat of the moment,\" said Moustapha Naite, deputy government spokesman. \"He didn't survive his injuries and is dead.\"\nThe demonstrators, protesting against a delay in holding local elections in the West African country, erected makeshift barricades in Labe, several hundred kilometers northeast of Conakry, and threw rocks at police who responded with tear gas.\n\"It is currently really tense in Labe,\" Naite said, adding that the authorities were trying to calm the situation.\nHundreds of people also marched in the capital Conakry as well as the cities of Kindia and Dab", "baseline_completion": "ola as part of a nationwide protest, considered illegal by the government, against the timing of elections.\nThe opposition accuses the government of breaking a promise it made in 2013 to hold a long-delayed local ballot before a presidential vote due in October this year.\nPresident Alpha Conde told journalists during a visit to Paris on Wednesday that there were no plans to change the electoral calendar.\nIn Conakry's suburb of Bambeto, residents said they heard a spurt of gunfire at noon, without specifying the origin.\nA local radio station Lynx FM said that several people with bullet injuries had been brought into a local clinic in the capital, although this could not be independently verified.\n\"Since this morning, we are trying to stop protesters from gathering. Whenever we see a group we try to disperse them rapidly,\" said a police officer, requesting anonymity. He said he was not aware of reports of gunfire.\nProtests earlier this month turned violent and the opposition accuses security forces of firing live rounds at protesters, wounding several people. The government denies this.\nPresidential and legislative elections since 2010, when Guinea emerged from decades of military rule, have been marred by violent protests, with parties divided along ethnic lines.\nMembers of the opposition said on Thursday that police forces were surrounding the houses of their leaders to prevent them from participating in the protest.\n\"They blocked the two exits with pick-up trucks and a van with water cannons. Clearly, they don't want leaders to get out and are trying to control the protest,\" said Souleymane Tianguel Bah, spokesman for the UFDG party.\nSidya Toure, former prime minister and now a member of the opposition, said security forces were also outside his home.", "orig_sample_length": 560, "prompt_length": 201, "real_completion_length": 359, "no_bl_gen_time": 10.297637939453125, "w_bl_gen_time": 12.548445701599121, "no_bl_output": "orte in the same as well known as well as well as well as well as well as well as well as well as well as well as you can be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "w_bl_output": "orte is a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.051746924318859924, "no_bl_tok_per_sec": 19.324820038348353, "w_bl_sec_per_tok": 0.06305751608843779, "w_bl_tok_per_sec": 15.858537760946783, "baseline_loss": 5.938486099243164, "baseline_ppl": 379.36016845703125, "no_bl_loss": 2.0239298343658447, "no_bl_ppl": 7.568007469177246, "w_bl_loss": 1.6761513948440552, "w_bl_ppl": 5.344945907592773}
{"idx": 88, "truncated_input": "Ford is building cars that \"talk\" with traffic lights, road signs and pedestrians.\nAt CES 2019 in Las Vegas on Monday, the automaker announced plans to start selling cars that feature this type of technology in 2022.\nThe technology, called cellular vehicle-to-everything (or C-V2X for short), uses wireless signals to share road data, such as a car's location or the color of a traffic light, with other vehicles.\nFord believes it will make cities safer by better informing drivers of their surroundings, and compares the innovation to the invention of the traffic light in the 19th century.\n\"The world's first traffic light [helped] people move through a congested London intersection that had become dangerous for pedestrians due to the popularity of horse-drawn carriages,\" Don Butler, executive director of Ford Connected Vehicle Platform and Product, wrote in a Medium post. \"At Ford, 150 years later, we are excited to continue advancing this type of thinking", "baseline_completion": ".\"\nBut critics says the cost of installing the technology will be burdensome for cash-strapped governments. Corinne Kisner, deputy director of the National Association of City Transportation Officials, called the expense of installing and maintaining vehicle-to-everything technology a major concern. Many municipalities struggle to fill their potholes, let alone install smart city technology. She also described any effort to require a pedestrian to carry a smartphone to guarantee safety as a dangerous paradigm shift.\n\"It's an unreasonable burden to ask or require people walking in their streets and cities and in front of their homes to carry a signal transmitting device,\" Kisner said. \"The burden needs to be on the driver of the two-ton vehicle, whether it's a human or autonomous technology.\"\nFord sees things differently. Butler described to CNN Business the example of a pedestrian walking on a dirt road who might be identified by a car with C-V2X because they were carrying a smartphone. Traditionally, a driver would rely on their headlights to see the pedestrian. But Butler stops short of expecting smartphones to be recommended or required for pedestrians.\n\"It's like the question of will people be permitted to drive once autonomous vehicles become prevalent,\" Butler said. \"That's something we can only speculate about.\"\nFord isn't the first company to explore outfitting pedestrians with sensors. Siemens, the German conglomerate, began a US Department of Transportation pilot test in Tampa, Florida, last year using pedestrians' smartphones to communicate their location to vehicles. But Siemens officials found the smartphone location data to be so inaccurate that it wasn't useful.\nThe pilot was reworked to focus on outfitting 1,000 vehicles with sensors, and notifying drivers of nearby vehicles with audio alerts, according to Dave Miller, the head of connected vehicles at Siemens.\nBicycling advocates also argued it was unrealistic to require someone to carry a phone on roads.\n\"We think the way things are headed, what we need is more smart sensors [built] in the roadway, or infrastructure,\" Miller told CNN Business.\nThis is something Ford wants, too. It sees the coming arrival of 5G networks -- the next-generation of internet speed -- as a chance to install vehicle-to-everything technology throughout cities.\n\"We think there's an opportunity for a win-win that helps offset to a significant degree the cost a city might have to otherwise undertake to deploy this infrastructure,\" Butler said.\nFord is urging other automakers to install C-V2X in their vehicles.\nBut there's a long road ahead for Ford to make C-V2X as widespread as the traffic light, which took decades to be popularized.", "orig_sample_length": 749, "prompt_length": 201, "real_completion_length": 548, "no_bl_gen_time": 10.310310363769531, "w_bl_gen_time": 12.583952188491821, "no_bl_output": " of the", "w_bl_output": " about the", "no_bl_num_tokens_generated": 2, "w_bl_num_tokens_generated": 2, "no_bl_sec_per_tok": 5.155155181884766, "no_bl_tok_per_sec": 0.1939805815184776, "w_bl_sec_per_tok": 6.291976094245911, "w_bl_tok_per_sec": 0.1589325809604573, "baseline_loss": 6.299808025360107, "baseline_ppl": 544.4673461914062, "no_bl_loss": 1.5107066631317139, "no_bl_ppl": 4.529930591583252, "w_bl_loss": 1.792296051979065, "w_bl_ppl": 6.003220558166504}
{"idx": 92, "truncated_input": "Trump's new immigration ad was panned as racist. Turns out it was also based on a falsehood. - Hartford Courant Trump's new immigration ad was panned as racist. Turns out it was also based on a falsehood.\nTrump's new immigration ad was panned as racist. Turns out it was also based on a falsehood.\nThe expletive-filled advertisement President Donald Trump released this week, seemingly to raise fears about immigration in advance of the midterm elections, was widely denounced, with Democrats and even some Republicans criticizing it as racist.\nBut, beyond the outrage, the ad was also reportedly based on a falsehood.\nThe 53-second video focuses on the courtroom behavior of Luis Bracamontes, an undocumented immigrant who was convicted of killing two sheriff's deputies in California in 2014 and bragged about it during the trial.\n\"Democrats let him into our country,\" the ad's script reads. \"Democrats let him stay.\"\nJust one problem: It doesn", "baseline_completion": "'t appear to be true.\nBracamontes, who had been deported multiple times before his crime spree, last entered the country while George W. Bush was president, sometime between May 2001 and February 2002, when there is a record for his marriage in Arizona, according to the Sacramento Bee.\nHe lived near Salt Lake City until 2014, when a methamphetamine-fueled road trip ended with the murder of the two Sacramento-area deputies, according to the Bee.\nThe ad also failed to mention that in 1998 he was arrested on drug charges in Phoenix, then released by the office of Maricopa County Sheriff Joe Arpaio \"for reasons unknown,\" the Bee reported.\nArpaio, a close Trump ally who has made waves for his hard-line immigration policies and rhetoric, was convicted in 2017 for ignoring a federal judge's order to stop detaining people on the suspicion of being undocumented immigrants. He was later pardoned by Trump.\nThe Maricopa County Sheriff's Office did not respond to a request for comment.\nBracamontes had been deported under both Democratic and Republican presidencies.\nHe was first arrested on charges related to marijuana possession in Phoenix in 1996 and sentenced to four months in jail, the Bee reported. He served his time and was deported in 1997, when Bill Clinton was president, only to be deported again in 2001 soon after being arrested on marijuana charges, according to the Bee.\nBracamontes has been sentenced to the death penalty in the murder case.", "orig_sample_length": 509, "prompt_length": 201, "real_completion_length": 308, "no_bl_gen_time": 10.294747829437256, "w_bl_gen_time": 12.579195022583008, "no_bl_output": " so far out of the end up to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able", "w_bl_output": ".\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis is a few years ago, as well-\n\n\n\n\n\n\n\n\n\n\n\n\nI'me-\n\n\n\n\n\n\nI'me\n\n\n\n\n\n\nI'me\n\n\n\n\nYou can be\n\n\n\n\nYou can be\n\n\n\n\n\nI'me\n\n\n\n\nI'm\n\n\n\nI'm\n\n\n\nI'm\n\n\nI'm\n\n\n\nI\n\n\nI'm\n\n\nI'm\n\n\n\nI'm\n\n\n\nI'm\n\n\n\nI'm\n\n\nI'm\n\n\n\nI\n\nI'm\n\n\n\n\nI'm\n\n\nI'm\n\n\nI\n\n\nI'm\n\n\nI\n\nI'm\n\n\n", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 198, "no_bl_sec_per_tok": 0.05173240115295103, "no_bl_tok_per_sec": 19.33024521795188, "w_bl_sec_per_tok": 0.06353128799284348, "w_bl_tok_per_sec": 15.740275879699553, "baseline_loss": 5.632671356201172, "baseline_ppl": 279.40753173828125, "no_bl_loss": 1.9090855121612549, "no_bl_ppl": 6.746915817260742, "w_bl_loss": 5.019183158874512, "w_bl_ppl": 151.2876739501953}
{"idx": 93, "truncated_input": "Customers line up to purchase lottery tickets, Monday, Oct. 22, 2018, at La Preferida Superdiscount store in Hialeah, Fla.\nFor all the anticipation about whether someone will finally snag the gigantic Mega Millions and Powerball jackpots, the games come down to two things: simple math — and very long odds.\nBut there are some quirks and surprises about the math equations that likely will soon vault someone into stratospheric wealth after the jackpots grew for months without a winner.\nThe biggest quirk starts with this fact: The advertised $1.6 billion Mega Millions prize — the world's largest ever lottery jackpot — and $620 million Powerball prize aren't quite real. That is, those are the amount you'd be paid if you chose an annuity, doled out over 29 years. Nearly every winner opts for cash, which is the amount of money the lottery folks actually have in the bank ready to pay out to the company", "baseline_completion": " that would fund the annuity.\nThe cash option is still massive, at $904 million for Mega Millions and $354.3 million for Powerball. But those numbers aren't splayed across billboards and shown in countless mini marts across America.\nThe dismal odds of winning the Mega Millions jackpot — 1 in 302.5 million — mean there are 302.5 million potential number combinations, or a little less than one combination for each of the 328 million people living in the U.S. For last Friday's drawing, about 59 per cent of possible combinations were taken. But by Tuesday night's drawing, officials estimate that 75 per cent will be sold.\nThat would mean a 25 per cent chance of no winner. If that happens, it's likely even more combinations would be covered before the next drawing three days later. Officials don't have an estimate on how many tickets would be sold for that potential drawing, and they haven't said how large the estimated prize would be. Could it reach $2 billion?\nThe odds of winning Powerball are 1 in 292.2 million.\nThe odds of winning don't change as jackpots get larger, but the chance that more than one winner will share the prize do. When so many people rush to play as a jackpot soars , the chances increase that two or three tickets — of the millions of tickets sold — will match. Of the five largest jackpots awarded in the U.S., three went to multiple winners. The largest single prize went to a 2017 player from Massachusetts who celebrated a $758.7 million Powerball payday.\nIf the odds of winning either Mega Millions or Powerball don't seem gigantic enough, how about winning them both? Spend $4 on a ticket for each game and it could happen. But the odds aren't especially favourable, at about 1 in 88 quadrillion (that's 88,000,000,000,000,000).\nFor Mega Millions, players choose six numbers: five from a range of white balls, numbered 1 to 70, and one number for the Mega Ball, with a range of 1 to 25. What numbers have come up most? Since 2010, that honour goes to the number 2, with 92 hits, followed by the numbers 20, 11, 31 and 17. The most hit Mega Ball number is 9.\nLottery officials are quick to point out that the number selection is random, so there's no reason that what hit in the past will be selected again. The game also has changed over the years, so some numbers included weren't always in the mix.\nNot surprisingly, the most Mega Million jackpot winners in the past five years have come from states with the largest populations. New York, with the nation's fourth-largest population, leads with seven winners. The No. 1 population state of California is second in Mega Millions winners with six, while Illinois is third with four winners.\nStill, there are some quirks, as Georgia has the eight-largest population and three winners and Washington state has two winners but only the 13th largest population. Texas has the nation's second-largest population, yet players have only bought winning Mega Millions tickets in the state twice in the past five years. And let's hear it for Rhode Island, the smallest population state to have won a Mega Millions jackpot in the past five years.\nFor those with an international bent, the current Mega Millions jackpot has surpassed all lottery jackpot records — so it's not only the largest lottery prize in U.S. history, it's now the world's largest.\nThe annual El Gordo national lottery in Spain advertises a larger total prize pool, but the money is divvied up into many prizes, according to Seth Elkin, a spokesman for the Maryland lottery, which currently takes questions about the Mega Millions drawing.", "orig_sample_length": 985, "prompt_length": 201, "real_completion_length": 784, "no_bl_gen_time": 10.303752183914185, "w_bl_gen_time": 12.522626876831055, "no_bl_output": "’s to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "w_bl_output": " is a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few days of a few", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.05177764916539791, "no_bl_tok_per_sec": 19.313352694047808, "w_bl_sec_per_tok": 0.06292777325040731, "w_bl_tok_per_sec": 15.891234479578973, "baseline_loss": 5.946047306060791, "baseline_ppl": 382.2394714355469, "no_bl_loss": 1.7798830270767212, "no_bl_ppl": 5.929162979125977, "w_bl_loss": 1.667637825012207, "w_bl_ppl": 5.2996344566345215}
{"idx": 94, "truncated_input": "• Engage with other SRA functions to support the evidence gathering and credible deterrence approach of the SRA.\nThe role of a Forensic Investigator is a key component part of the Investigation and Supervision Directorate within the SRA. As a Forensic Investigator, you will attend solicitors’ premises throughout England & Wales to identify, investigate and report serious breaches of all rules (Accounting and Conduct).\nYou will also investigate serious fraud and dishonesty not specifically covered by the Rules but which are considered likely to bring the profession into disrepute.\nYou will need to understand our code and principles, which often include mortgage fraud, money laundering, probate fraud, or other schemes as they arise. You will be required, where applicable, to secure admissible evidence for use in the Solicitors’ Disciplinary Tribunal and, if the matter proceeds to a criminal prosecution, at Court.\nThe role is based either in either our offices in Birmingham or London. However, you will be", "baseline_completion": " required to travel extensively throughout England and Wales, for which a car allowance is provided, subject to minimum mileage criteria. The appropriate equipment will be provided to enable you to work in the field.\n• Experience in accountancy, law or relevant regulation / investigative environment.\n• Experience of analysing complex information and translating it into plain, simple language.\n• You should be flexible, tenacious and able to adjust your priorities at short notice.\n• Be an excellent communicator, both orally and in writing.\nPlease make sure that your application clearly demonstrates how you meet the knowledge, skills and experience requirements of the role.\nInterviews for Birmingham based candidates will take place on 29 November 2017 and for London based candidates the 30 November 2017. Please make sure you clearly state on your application the location that you wish to be based from.\nExperience in accountancy, law or relevant regulation / investigative environment.\nAbility to analyse, assimilate and apply numerical and financial information from a wide range of sources to reach conclusions.\nAbility to apply regulation and rules to cases.\nWorking knowledge of Fraud Act, Money Laundering Regulations and the Proceeds of Crime Act.\nResilient and able to cope in a high challenging environment.\nDegree and or ideally hold a professional qualification such as an accountancy or legal qualification.\nPlease state which location you wish to be based from, London or Birmingham.\nThe SRA is the independent regulator of solicitors and law firms in England and Wales, protecting consumers and supporting the rule of law and the administration of justice. We do this by overseeing all education and training requirements necessary to practise as a solicitor, licensing individuals and firms to practise, setting the standards of the profession and regulating and enforcing compliance against these standards.\nWe offer a generous flexible benefits package, a friendly working environment and the opportunity to develop your career within a professional organisation.", "orig_sample_length": 583, "prompt_length": 201, "real_completion_length": 382, "no_bl_gen_time": 10.322537422180176, "w_bl_gen_time": 12.544804096221924, "no_bl_output": " able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to to be able to be able to be able to be able to be able to to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "w_bl_output": " able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.051872047347639075, "no_bl_tok_per_sec": 19.27820572220993, "w_bl_sec_per_tok": 0.06303921656392926, "w_bl_tok_per_sec": 15.863141303253364, "baseline_loss": 5.9195027351379395, "baseline_ppl": 372.2265625, "no_bl_loss": 1.8069695234298706, "no_bl_ppl": 6.091958045959473, "w_bl_loss": 1.7864526510238647, "w_bl_ppl": 5.968243598937988}
{"idx": 96, "truncated_input": "MidMichigan Health plans to restructure and re-align its work force in the coming months, and the changes could mean laying off as many as 1 percent of the company's nearly 5,000 workers.\nMidMichigan Health is the parent company of MidMichigan Medical Center-Midland as well as Medical Centers in Clare, Gladwin and Alma. The company also owns other health care facilities including home health care and nursing homes.\nIn a news release, the company said the restructuring is needed because of changes in the way health care is provided, the economy and health reform. These factors are affecting health care organizations in Michigan and nationwide, the news release stated.\nThe health system has a work force of 4,831. Officials will not know the number of employees who could lose their jobs until the restructuring is completed in mid-May. But it is expected to be less than 1 percent of all employees.\nCompany officials said these changes are happening just as demand for health care services is", "baseline_completion": " increasing in some areas and decreasing in others. Growing areas include physician practices, emergency services and critical care. In the past nine months, MidMichigan has added 50 new physicians and what the company calls mid-level providers. New positions include primary-care providers, specialists and a new critical care team.\n\"MidMichigan's vision is to be an integrated health system, and we have been working toward that vision for more than three years,\" said Richard M. Reynolds, president of MidMichigan Health. \"With changes in the health care environment and declining reimbursement we are challenged to shift our resources and realign our employees to continue to provide excellent clinical quality and excellent patient experiences in a safe environment. Doing that means that we have to change and re-tool how we do things.\"\nDeveloping new physician practices requires clinical and support staff. As a result, MidMichigan Health plans to take staff members from under-utilized areas and put them in open positions. Some people could lose their jobs, the company said, because they cannot be redeployed into open positions.\nManagement of some departments throughout the four hospitals will be re-aligned, and some services will be consolidated, the news release said.\n\"Our business is changing,\" said Lynn Bruchhof, MidMichigan Health vice president of human resources. \"We are fortunate to be able to realign our talent resources, our people, to areas of growth and need throughout MidMichigan Health.\"\nSome employees will retire, while others are volunteering to take part-time positions, and still others are applying for the 120 open positions in MidMichigan Health, she said.", "orig_sample_length": 528, "prompt_length": 201, "real_completion_length": 327, "no_bl_gen_time": 10.32000994682312, "w_bl_gen_time": 12.627466678619385, "no_bl_output": " not to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able to be able", "w_bl_output": " known as well-based on behalf of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety of a variety", "no_bl_num_tokens_generated": 199, "w_bl_num_tokens_generated": 199, "no_bl_sec_per_tok": 0.05185934646644784, "no_bl_tok_per_sec": 19.282927150788215, "w_bl_sec_per_tok": 0.06345460642522303, "w_bl_tok_per_sec": 15.759297178502436, "baseline_loss": 5.857021808624268, "baseline_ppl": 349.6811828613281, "no_bl_loss": 1.8131150007247925, "no_bl_ppl": 6.12951135635376, "w_bl_loss": 1.4584800004959106, "w_bl_ppl": 4.299419403076172}
